[
  {
    "content": "Effective: March 2020\nPurpose\n\nThe purpose of this full-time work-from-home policy is to provide guidelines and support for employees to conduct their work remotely, ensuring the continuity and productivity of onedrive operations during the COVID-19 pandemic and beyond.\nScope\n\nThis policy applies to all employees who are eligible for remote work as determined by their role and responsibilities. It is designed to allow employees to work from home full time while maintaining the same level of performance and collaboration as they would in the office.\nEligibility\n\nEmployees who can perform their work duties remotely and have received approval from their direct supervisor and the HR department are eligible for this work-from-home arrangement.\nEquipment and Resources\n\nThe necessary equipment and resources will be provided to employees for remote work, including a company-issued laptop, software licenses, and access to secure communication tools. Employees are responsible for maintaining and protecting the company's equipment and data.\nWorkspace\n\nEmployees working from home are responsible for creating a comfortable and safe workspace that is conducive to productivity. This includes ensuring that their home office is ergonomically designed, well-lit, and free from distractions.\nCommunication\n\nEffective communication is vital for successful remote work. Employees are expected to maintain regular communication with their supervisors, colleagues, and team members through email, phone calls, video conferences, and other approved communication tools.\nWork Hours and Availability\n\nEmployees are expected to maintain their regular work hours and be available during normal onedrive hours, unless otherwise agreed upon with their supervisor. Any changes to work hours or availability must be communicated to the employee's supervisor and the HR department.\nPerformance Expectations\n\nEmployees working from home are expected to maintain the same level of performance and productivity as if they were working in the office. Supervisors and team members will collaborate to establish clear expectations and goals for remote work.\nTime Tracking and Overtime\n\nEmployees are required to accurately track their work hours using the company's time tracking system. Non-exempt employees must obtain approval from their supervisor before working overtime.\nConfidentiality and Data Security\n\nEmployees must adhere to the company's confidentiality and data security policies while working from home. This includes safeguarding sensitive information, securing personal devices and internet connections, and reporting any security breaches to the IT department.\nHealth and Well-being\n\nThe company encourages employees to prioritize their health and well-being while working from home. This includes taking regular breaks, maintaining a work-life balance, and seeking support from supervisors and colleagues when needed.\nPolicy Review and Updates\n\nThis work-from-home policy will be reviewed periodically and updated as necessary, taking into account changes in public health guidance, onedrive needs, and employee feedback.\nQuestions and Concerns\n\nEmployees are encouraged to direct any questions or concerns about this policy to their supervisor or the HR department.\n",
    "summary": "This policy outlines the guidelines for full-time remote work, including eligibility, equipment and resources, workspace requirements, communication expectations, performance expectations, time tracking and overtime, confidentiality and data security, health and well-being, and policy reviews and updates. Employees are encouraged to direct any questions or concerns",
    "name": "Work From Home Policy",
    "url": "./sharepoint/Work from home policy.txt",
    "created_on": "2020-03-01",
    "updated_at": "2020-03-01",
    "category": "teams",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Starting May 2022, the company will be implementing a two-day in-office work requirement per week for all eligible employees. Please coordinate with your supervisor and HR department to schedule your in-office workdays while continuing to follow all safety protocols.\n",
    "summary": "Starting May 2022, employees will need to work two days a week in the office. Coordinate with your supervisor and HR department for these days while following safety protocols.",
    "name": "April Work From Home Update",
    "url": "./sharepoint/April work from home update.txt",
    "created_on": "2022-04-29",
    "updated_at": "2022-04-29",
    "category": "teams",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "As we continue to prioritize the well-being of our employees, we are making a slight adjustment to our hybrid work policy. Starting May 1, 2023, employees will be required to work from the office three days a week, with two days designated for remote work. Please communicate with your supervisor and HR department to establish your updated in-office workdays.\n",
    "summary": "Starting May 1, 2023, our hybrid work policy will require employees to work from the office three days a week and two days remotely.",
    "name": "Wfh Policy Update May 2023",
    "url": "./sharepoint/WFH policy update May 2023.txt",
    "created_on": "2023-05-01",
    "updated_at": "2023-05-01",
    "category": "teams",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Executive Summary:\nThis sales strategy document outlines the key objectives, focus areas, and action plans for our tech company's sales operations in fiscal year 2024. Our primary goal is to increase revenue, expand market share, and strengthen customer relationships in our target markets.\n\nI. Objectives for Fiscal Year 2024\n\nIncrease revenue by 20% compared to fiscal year 2023.\nExpand market share in key segments by 15%.\nRetain 95% of existing customers and increase customer satisfaction ratings.\nLaunch at least two new products or services in high-demand market segments.\n\nII. Focus Areas\nA. Target Markets:\nContinue to serve existing markets with a focus on high-growth industries.\nIdentify and penetrate new markets with high potential for our products and services.\n\nB. Customer Segmentation:\nStrengthen relationships with key accounts and strategic partners.\nPursue new customers in underserved market segments.\nDevelop tailored offerings for different customer segments based on their needs and preferences.\n\nC. Product/Service Portfolio:\nOptimize the existing product/service portfolio by focusing on high-demand solutions.\nDevelop and launch innovative products/services in emerging onedrive areas.\nEnhance post-sales support and customer service to improve customer satisfaction.\n\nIII. Action Plans\nA. Sales Team Development:\nExpand the sales team to cover new markets and industries.\nProvide ongoing training to sales staff on product knowledge, sales techniques, and industry trends.\nImplement a performance-based incentive system to reward top performers.\n\nB. Marketing and Promotion:\nDevelop targeted marketing campaigns for different customer segments and industries.\nLeverage digital marketing channels to increase brand visibility and lead generation.\nParticipate in industry events and trade shows to showcase our products and services.\n\nC. Partner Ecosystem:\nStrengthen existing partnerships and establish new strategic alliances to expand market reach.\nCollaborate with partners on joint marketing and sales initiatives.\nProvide partner training and support to ensure they effectively represent our products and services.\n\nD. Customer Success:\nImplement a proactive customer success program to improve customer retention and satisfaction.\nDevelop a dedicated customer support team to address customer inquiries and concerns promptly.\nCollect and analyze customer feedback to identify areas for improvement in our products, services, and processes.\n\nIV. Monitoring and Evaluation\nEstablish key performance indicators (KPIs) to track progress toward our objectives.\nConduct regular sales team meetings to review performance, share best practices, and address challenges.\nConduct quarterly reviews of our sales strategy to ensure alignment with market trends and adjust as needed.\n\nBy following this sales strategy for fiscal year 2024, our tech company aims to achieve significant growth and success in our target markets, while also providing exceptional value and service to our customers.\n",
    "summary": "This sales strategy document outlines objectives, focus areas, and action plans for our tech company's sales operations in fiscal year 2024. Our primary goal is to increase revenue, expand market share, and strengthen customer relationships in our target markets. Focus areas include targeting new markets, segmenting customers, enhancing",
    "name": "Fy2024 Company Sales Strategy",
    "url": "./sharepoint/FY2024 Company Sales Strategy.txt",
    "category": "teams",
    "created_on": "2023-04-15",
    "updated_at": "2023-04-15",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Purpose\n\nThe purpose of this vacation policy is to outline the guidelines and procedures for requesting and taking time off from work for personal and leisure purposes. This policy aims to promote a healthy work-life balance and encourage employees to take time to rest and recharge.\nScope\n\nThis policy applies to all full-time and part-time employees who have completed their probationary period.\nVacation Accrual\n\nFull-time employees accrue vacation time at a rate of [X hours] per month, equivalent to [Y days] per year. Part-time employees accrue vacation time on a pro-rata basis, calculated according to their scheduled work hours.\n\nVacation time will begin to accrue from the first day of employment, but employees are eligible to take vacation time only after completing their probationary period. Unused vacation time will be carried over to the next year, up to a maximum of [Z days]. Any additional unused vacation time will be forfeited.\nVacation Scheduling\n\nEmployees are required to submit vacation requests to their supervisor at least [A weeks] in advance, specifying the start and end dates of their vacation. Supervisors will review and approve vacation requests based on onedrive needs, ensuring adequate coverage during the employee's absence.\n\nEmployees are encouraged to plan their vacations around the company's peak and non-peak periods to minimize disruptions. Vacation requests during peak periods may be subject to limitations and require additional advance notice.\nVacation Pay\n\nEmployees will receive their regular pay during their approved vacation time. Vacation pay will be calculated based on the employee's average earnings over the [B weeks] preceding their vacation.\nUnplanned Absences and Vacation Time\n\nIn the event of an unplanned absence due to illness or personal emergencies, employees may use their accrued vacation time, subject to supervisor approval. Employees must inform their supervisor as soon as possible and provide any required documentation upon their return to work.\nVacation Time and Termination of Employment\n\nIf an employee's employment is terminated, they will be paid out for any unused vacation time, calculated based on their current rate of pay.\nPolicy Review and Updates\n\nThis vacation policy will be reviewed periodically and updated as necessary, taking into account changes in labor laws, onedrive needs, and employee feedback.\nQuestions and Concerns\n\nEmployees are encouraged to direct any questions or concerns about this policy to their supervisor or the HR department.\n",
    "summary": ": This policy outlines the guidelines and procedures for requesting and taking time off from work for personal and leisure purposes. Full-time employees accrue vacation time at a rate of [X hours] per month, equivalent to [Y days] per year. Vacation requests must be submitted to supervisors at least",
    "name": "Company Vacation Policy",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/ES6rw9bKZxVBobG1WUoJpikBF9Bhx1pw_GvJWbsg-Z_HNA?e=faSHVt",
    "created_on": "2018-04-15",
    "updated_at": "2018-04-16",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },

  {
    "content": "This career leveling matrix provides a framework for understanding the various roles and responsibilities of Software Engineers, as well as the skills and experience required for each level. This matrix is intended to support employee development, facilitate performance evaluations, and provide a clear career progression path.\nJunior Software Engineer\n\nResponsibilities:\nCollaborate with team members to design, develop, and maintain software applications and components.\nWrite clean, well-structured, and efficient code following established coding standards.\nParticipate in code reviews, providing and receiving constructive feedback.\nTroubleshoot and resolve software defects and issues.\nAssist with the creation of technical documentation.\nContinuously learn and stay up-to-date with new technologies and best practices.\n\nSkills & Experience:\nBachelor’s degree in Computer Science or a related field, or equivalent work experience.\nBasic understanding of software development principles and methodologies.\nProficiency in at least one programming language.\nStrong problem-solving and analytical skills.\nEffective communication and collaboration skills.\nEagerness to learn and grow within the field.\nSenior Software Engineer\n\nResponsibilities:\nDesign, develop, and maintain complex software applications and components.\nLead and mentor junior team members in software development best practices and techniques.\nConduct code reviews and ensure adherence to coding standards and best practices.\nCollaborate with cross-functional teams to define, design, and deliver software solutions.\nIdentify, troubleshoot, and resolve complex software defects and issues.\nContribute to the creation and maintenance of technical documentation.\nEvaluate and recommend new technologies, tools, and practices to improve software quality and efficiency.\n\nSkills & Experience:\nBachelor’s degree in Computer Science or a related field, or equivalent work experience.\n5+ years of software development experience.\nProficiency in multiple programming languages and technologies.\nDemonstrated ability to design and implement complex software solutions.\nStrong leadership, mentoring, and collaboration skills.\nExcellent problem-solving, analytical, and communication skills.\nPrincipal Software Engineer\n\nResponsibilities:\nLead the design, development, and maintenance of large-scale, mission-critical software applications and components.\nProvide technical leadership and mentorship to software engineering teams.\nDrive the adoption of advanced software development practices and technologies.\nCollaborate with product management, architecture, and other stakeholders to define and deliver strategic software initiatives.\nIdentify, troubleshoot, and resolve the most complex software defects and issues.\nCreate and maintain technical documentation, including architectural designs and best practice guidelines.\nRepresent [Company Name] as a thought leader in the software engineering community, including speaking at conferences, publishing articles, and contributing to open-source projects.\n\nSkills & Experience:\nBachelor’s degree in Computer Science or a related field, or equivalent work experience.\n10+ years of software development experience, with a focus on large-scale, mission-critical applications.\nExpertise in multiple programming languages, technologies, and software development methodologies.\nProven ability to lead and mentor high-performing software engineering teams.\nExceptional problem-solving, analytical, and communication skills.\nStrong onedrive acumen and ability to influence decision-making at the executive level.\n\nBy following this career leveling matrix, we aim to support the growth and development of Software Engineers, enabling them to reach their full potential and contribute meaningfully to the success of the organization.\n",
    "summary": "\nThis career leveling matrix provides a framework for understanding the various roles and responsibilities of Software Engineers, as well as the skills and experience required for each level. It is intended to support employee development, facilitate performance evaluations, and provide a clear career progression path.",
    "name": "Swe Career Matrix",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/EVYuEyRhHh5Aqc3a39sqbGcBkqKIHRWtJBjjUjNs6snpMg?e=nv1mf4",
    "created_on": "2018-04-15",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Title: Working with the Sales Team as an Engineer in a Tech Company\n\nIntroduction:\nAs an engineer in a tech company, collaboration with the sales team is essential to ensure the success of the company's products and services. This guidance document aims to provide an overview of how engineers can effectively work with the sales team, fostering a positive and productive working environment.\nUnderstanding the Sales Team's Role:\nThe sales team is responsible for promoting and selling the company's products and services to potential clients. Their role involves establishing relationships with customers, understanding their needs, and ensuring that the offered solutions align with their requirements.\n\nAs an engineer, it is important to understand the sales team's goals and objectives, as this will help you to provide them with the necessary information, tools, and support to successfully sell your company's products and services.\nCommunication:\nEffective communication is key to successfully working with the sales team. Make sure to maintain open lines of communication, and be responsive to their questions and concerns. This includes:\n\na. Attending sales meetings and conference calls when required.\nb. Providing regular product updates and training sessions to the sales team.\nc. Being available to answer technical questions and clarifications.\nCollaboration:\nCollaborate with the sales team in developing and refining sales materials, such as product presentations, demos, and technical documents. This will ensure that the sales team has accurate and up-to-date information to present to clients.\n\nAdditionally, work closely with the sales team on customer projects or product customizations, providing technical guidance, and ensuring that the solutions meet the customer's requirements.\nCustomer Engagement:\nAt times, engineers may be asked to join sales meetings or calls with potential clients to provide technical expertise. In these situations, it is important to:\n\na. Be prepared and understand the customer's needs and pain points.\nb. Clearly explain the technical aspects of the product or solution in a simple language that the customer can understand.\nc. Address any concerns or questions the customer may have.\nContinuous Improvement:\nActively seek feedback from the sales team regarding product performance, customer experiences, and market trends. Use this feedback to identify areas of improvement and collaborate with other engineers to enhance the product or service offerings.\nMutual Respect and Support:\nIt is essential to treat your colleagues in the sales team with respect and professionalism. Recognize and appreciate their efforts in promoting and selling the company's products and services. In turn, the sales team should also respect and appreciate the technical expertise and knowledge of the engineering team.\n\nBy working together, both the engineering and sales teams can contribute to the overall success of the company.\n\nConclusion:\nCollaboration between engineers and the sales team is crucial for a tech company's success. By understanding each other's roles, maintaining effective communication, collaborating on projects, and supporting one another, both teams can work together to achieve the company's goals and ensure customer satisfaction.\n",
    "summary": ": This guide provides an overview of how engineers can effectively collaborate with the sales team to ensure the success of a tech company. It includes understanding the sales team's role, communicating and collaborating on projects, engaging customers, and providing mutual respect and support.",
    "name": "Sales Engineering Collaboration",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/EW21-KJnfHBFoRiF49_uJMcBfHyPKimuPOFsCcJypQWaBQ?e=mGdIqe",
    "created_on": "2019-04-15",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Purpose\nThe purpose of this Intellectual Property Policy is to establish guidelines and procedures for the ownership, protection, and utilization of intellectual property generated by employees during their employment. This policy aims to encourage creativity and innovation while ensuring that the interests of both the company and its employees are protected.\n\nScope\nThis policy applies to all employees, including full-time, part-time, temporary, and contract employees.\n\nDefinitions\na. Intellectual Property (IP): Refers to creations of the mind, such as inventions, literary and artistic works, designs, symbols, and images, that are protected by copyright, trademark, patent, or other forms of legal protection.\nb. Company Time: Refers to the time during which an employee is actively engaged in performing their job duties.\nc. Outside Company Time: Refers to the time during which an employee is not engaged in performing their job duties.\n\nOwnership of Intellectual Property\na. Work Generated on Company Time\ni. Any intellectual property created, conceived, or developed by an employee during company time or using company resources, equipment, or facilities shall be considered the property of the Company.\nii. Employees are required to promptly disclose any such intellectual property to their supervisor or the appropriate department head.\nb. Work Generated Outside Company Time\ni. Intellectual property created, conceived, or developed by an employee outside of company time and without the use of company resources, equipment, or facilities shall generally remain the property of the employee.\nii. However, if the intellectual property is directly related to the employee's job responsibilities, or if the employee has used company resources, equipment, or facilities in its creation, it may be considered the property of the Company.\nProtection and Utilization of Intellectual Property\na. The Company shall have the right to protect, license, and commercialize any intellectual property owned by the company as it deems appropriate.\nb. Employees are expected to cooperate with the Company in obtaining any necessary legal protection for intellectual property owned by the company, including by signing any documents or providing any necessary information or assistance.\nConfidentiality\nEmployees are expected to maintain the confidentiality of any intellectual property owned by the Company and not disclose it to any third parties without the express written consent of an authorized representative of the company.\nEmployee Acknowledgment\nAll employees are required to sign an acknowledgment of this Intellectual Property Policy as a condition of their employment with [Company Name]. By signing the acknowledgment, employees agree to abide by the terms of this policy and understand that any violations may result in disciplinary action, up to and including termination of employment.\nPolicy Review\nThis Intellectual Property Policy shall be reviewed periodically and may be amended as necessary to ensure its continued effectiveness and compliance with applicable laws and regulations. Employees will be notified of any significant changes to this policy.\n",
    "summary": "This Intellectual Property Policy outlines guidelines and procedures for the ownership, protection, and utilization of intellectual property generated by employees during their employment. It establishes the company's ownership of work generated on company time, while recognizing employee ownership of work generated outside of company time without the use of company resources. The policy",
    "name": "Intellectual Property Policy",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/EWz3cYEVdzBNsiHsYbKhms4BVYGhravyrUw3T3lzxL4pTg?e=mPIgbO",
    "created_on": "2021-06-15",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },

  {
    "content": "Code of Conduct\nPurpose\n\nThe purpose of this code of conduct is to establish guidelines for professional and ethical behavior in the workplace. It outlines the principles and values that all employees are expected to uphold in their interactions with colleagues, customers, partners, and other stakeholders.\nScope\n\nThis code of conduct applies to all employees, contractors, and volunteers within the organization, regardless of their role or seniority.\nCore Values\n\nEmployees are expected to adhere to the following core values:\n\na. Integrity: Act honestly, ethically, and in the best interests of the organization at all times.\nb. Respect: Treat all individuals with dignity, courtesy, and fairness, regardless of their background, beliefs, or position.\nc. Accountability: Take responsibility for one's actions and decisions, and be willing to learn from mistakes.\nd. Collaboration: Work cooperatively with colleagues and partners to achieve shared goals and promote a positive work environment.\ne. Excellence: Strive for the highest standards of performance and continuously seek opportunities for improvement.\nCompliance with Laws and Regulations\n\nEmployees must comply with all applicable laws, regulations, and organizational policies in the course of their work. This includes, but is not limited to, employment laws, data protection regulations, and industry-specific guidelines.\nConflicts of Interest\n\nEmployees should avoid situations where their personal interests may conflict with or influence their professional judgment. If a potential conflict of interest arises, employees must disclose it to their supervisor or the appropriate authority within the organization.\nConfidentiality and Information Security\n\nEmployees are responsible for safeguarding the organization's confidential information, as well as any sensitive information entrusted to them by clients, partners, or other third parties. This includes adhering to data protection policies and using secure communication channels.\nHarassment and Discrimination\n\nThe organization is committed to providing a workplace free from harassment, discrimination, and bullying. Employees are expected to treat others with respect and report any incidents of inappropriate behavior to their supervisor or the human resources department.\nHealth and Safety\n\nEmployees must follow all health and safety guidelines and procedures to maintain a safe and healthy work environment. This includes reporting any hazards or unsafe conditions to the appropriate personnel.\nUse of Company Resources\n\nEmployees are expected to use company resources, including time, equipment, and funds, responsibly and for their intended purposes. Misuse or theft of company resources is strictly prohibited.\nReporting Violations\n\nEmployees have a responsibility to report any suspected violations of this code of conduct, as well as any illegal or unethical behavior, to their supervisor or the appropriate authority within the organization. The organization will protect the confidentiality of employees who report violations and will not tolerate retaliation against those who raise concerns.\nConsequences of Non-Compliance\n\nFailure to adhere to this code of conduct may result in disciplinary action, up to and including termination of employment. The organization reserves the right to take legal action against individuals who engage in illegal or unethical conduct.\nPolicy Review and Updates\n\nThis code of conduct will be reviewed periodically and updated as necessary to ensure it remains relevant and effective in promoting ethical behavior and professional standards within the organization.\nQuestions and Concerns\n\nEmployees are encouraged to seek guidance from their supervisor or the human resources department if they have questions or concerns about this code of conduct or its application to specific situations.\n",
    "summary": "This code of conduct outlines the principles and values that all employees are expected to uphold in their interactions with colleagues, customers, partners, and other stakeholders. It sets out core values such as integrity, respect, accountability, collaboration and excellence. Employees must comply with all applicable laws, regulations, and organizational",
    "name": "Code Of Conduct",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/ER3xmeKaZ_pAqPeJWyyNR0QBg6QmoWIGPhwfEyCABWHrPA?e=cvzrgV",
    "created_on": "2018-01-12",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Content:\nThe purpose of this office pet policy is to outline the guidelines and procedures for bringing pets into the workplace. This policy aims to create a positive and inclusive work environment while ensuring the comfort, safety, and well-being of all employees, visitors, and pets.\nScope\n\nThis policy applies to all employees who wish to bring their pets to the office. Pets covered under this policy include dogs, cats, and other small, non-exotic animals, subject to approval by the HR department.\nPet Approval Process\n\nEmployees must obtain prior approval from their supervisor and the HR department before bringing their pets to the office. The approval process includes:\n\na. Submitting a written request, including a description of the pet, its breed, age, and temperament.\nb. Providing proof of up-to-date vaccinations and any required licenses or permits.\nc. Obtaining written consent from all employees who share the workspace with the pet owner.\n\nThe HR department reserves the right to deny or revoke pet approval based on the specific circumstances or concerns raised by other employees.\nPet Behavior and Supervision\n\nEmployees are responsible for the behavior and well-being of their pets while in the office. Pets must be:\n\na. Well-behaved, non-aggressive, and not disruptive to the work environment.\nb. House-trained and able to eliminate waste in designated areas outside the office.\nc. Kept on a leash or in a secure enclosure when not in the employee's imonedrivete work area.\n\nEmployees must closely supervise their pets and promptly address any issues or concerns raised by other staff members.\nAllergies and Phobias\n\nEmployees with allergies or phobias related to pets must inform the HR department, which will work with the affected employees and pet owners to find a suitable solution. This may include adjusting workspaces, limiting the number or types of pets allowed, or implementing additional safety measures.\nCleanliness and Hygiene\n\nEmployees are responsible for maintaining a clean and hygienic work environment. This includes:\n\na. Cleaning up after their pets, both indoors and outdoors.\nb. Regularly grooming their pets to minimize shedding and odors.\nc. Ensuring their pets are free of pests, such as fleas and ticks.\nLiability\n\nPet owners are liable for any damage or injury caused by their pets. Employees are encouraged to obtain pet liability insurance to cover potential incidents.\nRestricted Areas\n\nPets are not allowed in certain areas of the office, including meeting rooms, restrooms, kitchen and dining areas, and any other designated spaces. Signage will be posted to indicate these restricted areas.\nPolicy Review and Updates\n\nThis office pet policy will be reviewed periodically and updated as necessary, taking into account employee feedback, changes in legislation, and best practices for maintaining a safe and inclusive work environment.\nQuestions and Concerns\n\nEmployees are encouraged to direct any questions or concerns about this policy to their supervisor or the HR department.\n",
    "summary": "This policy outlines the guidelines and procedures for bringing pets into the workplace. It covers approval process, pet behavior and supervision, allergies and phobias, cleanliness and hygiene, liability, restricted areas, and policy review. Employees must obtain prior approval from their supervisor and the HR department before bringing their",
    "name": "Office Pet Policy",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/ETf-69wBeaZJpAn3CY7ExRABQWvav-p24VOnB6C0A4l2pQ?e=X72WuK",
    "created_on": "2018-01-12",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Performance Management Policy\nPurpose and Scope\nThe purpose of this Performance Management Policy is to establish a consistent and transparent process for evaluating, recognizing, and rewarding employee performance. This policy applies to all employees and aims to foster a culture of continuous improvement, professional growth, and open communication between employees and management.\nPerformance Planning and Goal Setting\nAt the beginning of each performance cycle, employees and their supervisors will collaborate to set clear, achievable, and measurable performance goals. These goals should align with the company’s strategic objectives and take into account the employee’s job responsibilities, professional development, and career aspirations.\nOngoing Feedback and Communication\nThroughout the performance cycle, employees and supervisors are encouraged to engage in regular, constructive feedback and open communication. This includes discussing progress towards goals, addressing challenges, and identifying opportunities for improvement or additional support. Regular check-ins and updates help ensure that employees stay on track and receive the guidance they need to succeed.\nPerformance Evaluation\nAt the end of each performance cycle, employees will participate in a formal performance evaluation with their supervisor. This evaluation will assess the employee’s overall performance, including their achievements, areas for improvement, and progress towards goals. Both the employee and supervisor should come prepared to discuss specific examples, accomplishments, and challenges from the performance period.\nPerformance Ratings\nBased on the performance evaluation, employees will receive a performance rating that reflects their overall performance during the cycle. The rating system should be clearly defined and consistently applied across the organization. Performance ratings will be used to inform decisions regarding promotions, salary increases, and other rewards or recognition.\nPromotions and Advancements\nHigh-performing employees who consistently demonstrate strong performance, leadership, and a commitment to the company’s values may be considered for promotions or other advancement opportunities. Promotions will be based on factors such as performance ratings, skills, experience, and the needs of the organization. Employees interested in pursuing a promotion should discuss their career goals and development plans with their supervisor.\nPerformance Improvement Plans\nEmployees who receive a low performance rating or are struggling to meet their performance goals may be placed on a Performance Improvement Plan (PIP). A PIP is a structured plan designed to help the employee address specific areas of concern, set achievable improvement goals, and receive additional support or resources as needed. Employees on a PIP will be closely monitored and re-evaluated at the end of the improvement period to determine if satisfactory progress has been made.\nRecognition and Rewards\nOur company believes in recognizing and rewarding employees for their hard work and dedication. In addition to promotions and salary increases, employees may be eligible for other forms of recognition or rewards based on their performance. This may include bonuses, awards, or other incentives designed to motivate and celebrate employee achievements. The specific criteria and eligibility for these rewards will be communicated by the HR department or management.\n",
    "summary": "This Performance Management Policy outlines a consistent and transparent process for evaluating, recognizing, and rewarding employees. It includes goal setting, ongoing feedback, performance evaluations, ratings, promotions, and rewards. The policy applies to all employees and encourages open communication and professional growth.",
    "name": "Performance Management Policy",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/ERsxt9p1uehJqeJu4JlxkakBavbKwcldrYv_hpv3xHikAw?e=pf5R2C",
    "created_on": "2018-01-12",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },

  {
    "content": "Our sales organization is structured to effectively serve our customers and achieve our onedrive objectives across multiple regions. The organization is divided into the following main regions:\n\nThe Americas: This region includes the United States, Canada, Mexico, as well as Central and South America. The North America South America region (NASA) has two Area Vice-Presidents: Laura Martinez is the Area Vice-President of North America, and Gary Johnson is the Area Vice-President of South America.\n\nEurope: Our European sales team covers the entire continent, including the United Kingdom, Germany, France, Spain, Italy, and other countries. The team is responsible for understanding the unique market dynamics and cultural nuances, enabling them to effectively target and engage with customers across the region. The Area Vice-President for Europe is Rajesh Patel.\nAsia-Pacific: This region encompasses countries such as China, Japan, South Korea, India, Australia, and New Zealand. Our sales team in the Asia-Pacific region works diligently to capitalize on growth opportunities and address the diverse needs of customers in this vast and rapidly evolving market. The Area Vice-President for Asia-Pacific is Mei Li.\nMiddle East & Africa: This region comprises countries across the Middle East and Africa, such as the United Arab Emirates, Saudi Arabia, South Africa, and Nigeria. Our sales team in this region is responsible for navigating the unique market challenges and identifying opportunities to expand our presence and better serve our customers. The Area Vice-President for Middle East & Africa is Jamal Abdi.\n\nEach regional sales team consists of dedicated account managers, sales representatives, and support staff, led by their respective Area Vice-Presidents. They are responsible for identifying and pursuing new onedrive opportunities, nurturing existing client relationships, and ensuring customer satisfaction. The teams collaborate closely with other departments, such as marketing, product development, and customer support, to ensure we consistently deliver high-quality products and services to our clients.\n",
    "summary": "\nOur sales organization is divided into four regions: The Americas, Europe, Asia-Pacific, and Middle East & Africa. Each region is led by an Area Vice-President and consists of dedicated account managers, sales representatives, and support staff. They collaborate with other departments to ensure the delivery of high",
    "name": "Sales Organization Overview",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/EYsr1eqgn9hMslMJFLR-k54BBX-O3iC26bK7xNEBtYIBkg?e=xeAjiT",
    "created_on": "2018-01-15",
    "category": "sharepoint",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Introduction:\nThis document outlines the compensation bands strategy for the various teams within our IT company. The goal is to establish a fair and competitive compensation structure that aligns with industry standards, rewards performance, and attracts top talent. By implementing this strategy, we aim to foster employee satisfaction and retention while ensuring the company's overall success.\n\nPurpose:\nThe purpose of this compensation bands strategy is to:\na. Define clear guidelines for salary ranges based on job levels and market benchmarks.\nb. Support equitable compensation practices across different teams.\nc. Encourage employee growth and performance.\nd. Enable effective budgeting and resource allocation.\n\nJob Levels:\nTo establish a comprehensive compensation structure, we have defined distinct job levels within each team. These levels reflect varying degrees of skills, experience, and responsibilities. The levels include:\na. Entry-Level: Employees with limited experience or early career professionals.\nb. Interonedrivete-Level: Employees with moderate experience and demonstrated competence.\nc. Senior-Level: Experienced employees with advanced skills and leadership capabilities.\nd. Leadership-Level: Managers and team leaders responsible for strategic decision-making.\n\nCompensation Bands:\nBased on the job levels, the following compensation bands have been established:\na. Entry-Level Band: This band encompasses salary ranges for employees in entry-level positions. It aims to provide competitive compensation for individuals starting their careers within the company.\n\nb. Interonedrivete-Level Band: This band covers salary ranges for employees who have gained moderate experience and expertise in their respective roles. It rewards employees for their growing skill set and contributions.\n\nc. Senior-Level Band: The senior-level band includes salary ranges for experienced employees who have attained advanced skills and have a proven track record of delivering results. It reflects the increased responsibilities and expectations placed upon these individuals.\n\nd. Leadership-Level Band: This band comprises salary ranges for managers and team leaders responsible for guiding and overseeing their respective teams. It considers their leadership abilities, strategic thinking, and the impact they have on the company's success.\n\nMarket Benchmarking:\nTo ensure our compensation remains competitive, regular market benchmarking will be conducted. This involves analyzing industry salary trends, regional compensation data, and market demand for specific roles. The findings will inform periodic adjustments to our compensation bands to maintain alignment with the market.\n\nPerformance-Based Compensation:\nIn addition to the defined compensation bands, we emphasize a performance-based compensation model. Performance evaluations will be conducted regularly, and employees exceeding performance expectations will be eligible for bonuses, incentives, and salary increases. This approach rewards high achievers and motivates employees to excel in their roles.\n\nConclusion:\nBy implementing this compensation bands strategy, our IT company aims to establish fair and competitive compensation practices that align with market standards and foster employee satisfaction. Regular evaluations and market benchmarking will enable us to adapt and refine the strategy to meet the evolving needs of our organization.",
    "summary": "This document outlines a compensation framework for IT teams. It includes job levels, compensation bands, and performance-based incentives to ensure fair and competitive wages. Regular market benchmarking will be conducted to adjust the bands according to industry trends.",
    "name": "Compensation Framework For It Teams",
    "url": "https://enterprisesearch.sharepoint.com/:t:/s/MSBuilddemo/EaAFec6004tAg21g4i67rfgBBRqCm1yY7AZLLQyyaMtsEQ?e=wTMb4z",
    "created_on": "2018-01-12",
    "category": "sharepoint",
    "restricted": true,
    "_run_ml_inference": true,
    "rolePermissions": ["manager"]
  },
  {
    "content": "As an employee in Canada, it's essential to understand how to update your tax elections forms to ensure accurate tax deductions from your pay. This guide will help you navigate the process of updating your TD1 Personal Tax Credits Return form.\n\nStep 1: Access the TD1 form\nThe TD1 form is available on the Canada Revenue Agency (CRA) website. Your employer might provide you with a paper copy or a link to the online form. You can access the form directly through the following link: https://www.canada.ca/en/revenue-agency/services/forms-publications/td1-personal-tax-credits-returns.html\n\nStep 2: Choose the correct form version\nYou'll need to fill out the federal TD1 form and, if applicable, the provincial or territorial TD1 form. Select the appropriate version based on your province or territory of residence.\n\nStep 3: Download and open the form\nFor the best experience, download and open the TD1 form in Adobe Reader. If you have visual impairments, consider using the large print version available on the CRA website.\n\nStep 4: Complete the form\nFill out the form by entering your personal information, such as your name, Social Insurance Number (SIN), and address. Then, go through each section to claim any personal tax credits that apply to you. These credits may include:\nBasic personal amount\nAmount for an eligible dependant\nAmount for infirm dependants age 18 or older\nCaregiver amount\nDisability amount\nTuition and onedrive amounts\n\nRead the instructions carefully for each section to ensure you claim the correct amounts.\n\nStep 5: Sign and date the form\nOnce you've completed the form, sign and date it at the bottom.\n\nStep 6: Submit the form to your employer\nSubmit the completed and signed TD1 form to your employer. You can either scan and send it electronically, or provide a printed copy. Your employer will use the information on your TD1 form to calculate the correct amount of tax to be deducted from your pay.\n\nStep 7: Update your TD1 form as needed\nIt's essential to update your TD1 form whenever your personal circumstances change, such as getting married, having a child, or becoming eligible for a new tax credit. Inform your employer of these changes and submit an updated TD1 form to ensure accurate tax deductions.\n\nUpdating your tax elections forms is a crucial step in ensuring the correct tax deductions from your pay as a new employee in Canada. Follow this guide and keep your TD1 form up to date to avoid any discrepancies in your tax filings.\n",
    "summary": ": This guide gives a step-by-step explanation of how to update your TD1 Personal Tax Credits Return form. Access the form from the CRA website and choose the correct version based on your province or territory of residence. Download and open the form in Adobe Reader, fill out the form by entering",
    "name": "Updating Your Tax Elections Forms",
    "url": "./github/Updating Your Tax Elections Forms.txt",
    "created_on": "2022-12-20",
    "category": "github",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },
  {
    "content": "Welcome to our team! We are excited to have you on board and look forward to your valuable contributions. This onboarding guide is designed to help you get started by providing essential information about our policies, procedures, and resources. Please read through this guide carefully and reach out to the HR department if you have any questions.\nIntroduction to Our Company Culture and Values\nOur company is committed to creating a diverse, inclusive, and supportive work environment. We believe that our employees are our most valuable asset and strive to foster a culture of collaboration, innovation, and continuous learning. Our core values include:\nIntegrity: We act ethically and honestly in all our interactions.\nTeamwork: We work together to achieve common goals and support each other's growth.\nExcellence: We strive for the highest quality in our products, services, and relationships.\nInnovation: We encourage creativity and embrace change to stay ahead in the market.\nRespect: We treat each other with dignity and value the unique perspectives of all our colleagues.\nKey Onboarding Steps\nTo ensure a smooth onboarding process, please complete the following steps within your first week:\nAttend orientation: You will be invited to an orientation session to meet your colleagues and learn more about our company's onedrive, mission, and values.\nReview policies and procedures: Familiarize yourself with our employee handbook, which contains important information about our policies and procedures. Please read it thoroughly and adhere to the guidelines.\nComplete required training: You may be required to complete mandatory training sessions, such as safety training or anti-harassment training. Ensure that you attend and complete these sessions as soon as possible.\nUpdating Tax Elections and Documents\nIt is crucial to ensure your tax information is accurate and up-to-date, regardless of the country you work in. Please follow these steps to update your tax elections and documents:\nComplete tax forms: Fill out the necessary tax forms for your country or region, which determine the amount of income tax withheld from your paycheck. You should complete new tax forms if your personal or financial situation changes, such as marriage, divorce, or a change in the number of dependents.\nSubmit regional tax forms: Depending on your location, you may be required to complete additional regional or local tax forms. Check with the HR department to determine which forms are necessary.\nUpdate your address: If you move, make sure to update your address with the HR department to ensure accurate tax reporting.\nBenefits Enrollment\nAs a new employee, you are eligible for various benefits, including health insurance, retirement plans, and paid time off. You will receive detailed information about our benefits package during orientation. To enroll in the benefits, please follow these steps:\nReview benefits options: Carefully review the benefits package and choose the options that best meet your needs.\nComplete enrollment forms: Fill out the necessary forms to enroll in your chosen benefits. Submit these forms to the HR department within 30 days of your start date.\nDesignate beneficiaries: If applicable, designate beneficiaries for your life insurance and retirement plans.\nGetting Settled in Your Workspace\nTo help you feel comfortable and productive in your new workspace, take the following steps:\nSet up your workstation: Organize your desk, chair, and computer according to your preferences. If you require any additional equipment or accommodations, please contact the HR department.\nObtain necessary supplies: Request any necessary office supplies, such as pens, notepads, or folders, from the designated supply area or by contacting the appropriate department.\nFamiliarize yourself with office resources: Locate common areas, such as break rooms, restrooms, and meeting rooms. Familiarize yourself with office equipment, including printers, scanners, and telephones.\n",
    "summary": "\nThis onboarding guide provides essential information to new employees on our company culture and values, key onboarding steps, tax elections and documents, benefits enrollment, and setting up their workspace.",
    "name": "New Employee Onboarding Guide",
    "url": "./github/New Employee Onboarding guide.txt",
    "created_on": "2018-01-12",
    "category": "github",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "manager"]
  },




  {
    "content": "Study Tips for University Students:\n\n1. Create a Study Schedule:\n   - Allocate specific times for studying each subject.\n   - Include regular breaks to improve focus.\n\n2. Use Active Learning Techniques:\n   - Summarize key points in your own words.\n   - Practice past exam papers and solve problems.\n\n3. Optimize Your Study Environment:\n   - Find a quiet, well-lit space.\n   - Minimize distractions by turning off notifications.\n\n4. Join Study Groups:\n   - Collaborate with peers to share knowledge.\n   - Discuss complex topics to deepen understanding.\n\n5. Take Care of Yourself:\n   - Get 7-8 hours of sleep each night.\n   - Maintain a balanced diet and stay hydrated.",
    "summary": "Tips for effective studying include creating a schedule, using active learning techniques, optimizing your environment, joining study groups, and prioritizing self-care.",
    "name": "University Study Tips",
    "url": "./sharepoint/University_Study_Tips.txt",
    "created_on": "2024-02-10",
    "updated_at": "2024-02-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Online Learning Platforms (2024):\n\n1. Coursera:\n   - Offers courses from top universities like Stanford and Harvard.\n   - Includes professional certificates and degrees.\n\n2. Udemy:\n   - Features a wide range of courses at affordable prices.\n   - Topics range from programming to personal development.\n\n3. Khan Academy:\n   - Provides free resources for K-12 onedrive.\n   - Focuses on math, science, and test prep.\n\n4. edX:\n   - Partners with institutions like MIT and Oxford.\n   - Offers MicroMasters and professional tracks.\n\n5. Duolingo:\n   - Specializes in language learning with gamified lessons.\n   - Supports over 40 languages.",
    "summary": "Top online learning platforms in 2024 include Coursera, Udemy, Khan Academy, edX, and Duolingo, offering diverse topics and certifications.",
    "name": "Online Learning Platforms 2024",
    "url": "./sharepoint/Online_Learning_2024.txt",
    "created_on": "2024-03-01",
    "updated_at": "2024-03-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Productivity Tools for Students:\n\n1. Notion:\n   - Organize notes, tasks, and schedules in one place.\n   - Customizable templates for project management.\n\n2. Grammarly:\n   - Helps with grammar, spelling, and writing clarity.\n   - Useful for essays, emails, and research papers.\n\n3. Quizlet:\n   - Create digital flashcards for memorization.\n   - Use practice tests and games to reinforce learning.\n\n4. Google Workspace:\n   - Tools like Docs, Sheets, and Slides for collaboration.\n   - Cloud storage via Google Drive.\n\n5. Forest App:\n   - Encourages focus by growing virtual trees while you work.\n   - Prevents distractions from your phone.",
    "summary": "Top productivity tools for students include Notion for organization, Grammarly for writing, Quizlet for memorization, Google Workspace for collaboration, and Forest App for focus.",
    "name": "Productivity Tools for Students",
    "url": "./sharepoint/Productivity_Tools.txt",
    "created_on": "2024-01-15",
    "updated_at": "2024-01-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Scholarship Opportunities (2024):\n\n1. Fulbright Scholarship:\n   - For international students pursuing master's or Ph.D. programs in the US.\n   - Covers tuition, living expenses, and travel costs.\n\n2. Chevening Scholarship:\n   - For students pursuing one-year master's degrees in the UK.\n   - Fully funded by the UK government.\n\n3. DAAD Scholarship:\n   - For postgraduate courses in Germany.\n   - Includes monthly stipends and travel allowances.\n\n4. Rhodes Scholarship:\n   - For postgraduate studies at the University of Oxford.\n   - Open to students from specific countries.\n\n5. Erasmus+:\n   - Offers funding for study and internships in Europe.\n   - Available for undergraduate, master's, and doctoral students.",
    "summary": "Top scholarships in 2024 include Fulbright, Chevening, DAAD, Rhodes, and Erasmus+, covering various countries and academic levels.",
    "name": "Scholarship Opportunities 2024",
    "url": "./sharepoint/Scholarships_2024.txt",
    "created_on": "2023-12-20",
    "updated_at": "2023-12-20",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Common Challenges in Learning and How to Overcome Them:\n\n1. Procrastination:\n   - Break tasks into smaller steps.\n   - Use time management techniques like Pomodoro.\n\n2. Lack of Motivation:\n   - Set clear, achievable goals.\n   - Reward yourself for completing milestones.\n\n3. Difficulty Understanding Material:\n   - Seek clarification from teachers or peers.\n   - Use supplementary resources like online tutorials.\n\n4. Test Anxiety:\n   - Practice relaxation techniques like deep breathing.\n   - Prepare thoroughly with past exam papers.\n\n5. Balancing Study and Life:\n   - Create a daily routine that includes time for hobbies and rest.\n   - Avoid overloading your schedule.",
    "summary": "Overcome common learning challenges like procrastination, lack of motivation, and test anxiety by setting goals, managing time, and using relaxation techniques.",
    "name": "Learning Challenges and Solutions",
    "url": "./sharepoint/Learning_Challenges.txt",
    "created_on": "2024-01-05",
    "updated_at": "2024-01-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },



  {
    "content": "La Liga 2024 Standings (as of April 1, 2024):\n\n1. Real Madrid - 72 points\n2. Barcelona - 70 points\n3. Atltico Madrid - 65 points\n4. Sevilla - 60 points\n5. Real Sociedad - 58 points\n\nTop Scorers:\n1. Robert Lewandowski (Barcelona) - 25 goals\n2. Karim Benzema (Real Madrid) - 22 goals\n3. Antoine Griezmann (Atltico Madrid) - 18 goals\n\nUpcoming Matches:\n- Barcelona vs. Sevilla - April 6, 2024\n- Real Madrid vs. Atltico Madrid - April 7, 2024",
    "summary": "La Liga standings show Real Madrid leading with 72 points, followed by Barcelona and Atltico Madrid. Lewandowski tops the scoring chart with 25 goals.",
    "name": "La Liga 2024 Standings",
    "url": "./sharepoint/LaLiga_Standings_2024.txt",
    "created_on": "2024-04-01",
    "updated_at": "2024-04-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Match Preview: UEFA Champions League Quarterfinal - Paris Saint-Germain vs. Bayern Munich\n\nDate: April 10, 2024\nVenue: Parc des Princes, Paris\n\nKey Players to Watch:\n- PSG: Kylian Mbapp, Neymar, Gianluigi Donnarumma\n- Bayern: Harry Kane, Leroy San, Joshua Kimmich\n\nHead-to-Head:\n- Last Meeting: Bayern Munich 2-0 PSG (2023 Round of 16)\n- Overall Record: Bayern 6 wins, PSG 4 wins, 1 draw\n\nTactical Analysis:\n- PSG relies on high-paced counter-attacks with Mbapp's speed.\n- Bayern focuses on ball possession and pressing in midfield.\n\nPredicted Scoreline: PSG 2-2 Bayern Munich (First Leg).",
    "summary": "Preview of the UEFA Champions League quarterfinal between PSG and Bayern Munich, featuring tactical analysis and player highlights.",
    "name": "PSG vs Bayern Preview",
    "url": "./sharepoint/PSG_Bayern_Preview.txt",
    "created_on": "2024-04-05",
    "updated_at": "2024-04-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Transfer News (January 2024):\n\n- Joo Flix to Barcelona (Loan from Atltico Madrid)\n- Jude Bellingham to Real Madrid (120 million from Borussia Dortmund)\n- Declan Rice to Arsenal (105 million from West Ham United)\n- Harry Kane to Bayern Munich (100 million from Tottenham Hotspur)\n- Andr Onana to Manchester United (50 million from Inter Milan)\n\nBiggest Transfer Rumors:\n- Kylian Mbapp to Real Madrid\n- Victor Osimhen to Chelsea\n- Jadon Sancho to Borussia Dortmund (Return).",
    "summary": "January 2024 transfer window highlights include Jude Bellingham to Real Madrid, Harry Kane to Bayern Munich, and Joo Flix to Barcelona on loan.",
    "name": "January 2024 Transfer News",
    "url": "./sharepoint/Transfers_2024.txt",
    "created_on": "2024-01-31",
    "updated_at": "2024-01-31",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Player Profile: Erling Haaland (2024)\n\nClub: Manchester City (Premier League)\n\nSeason Stats:\n- Goals: 34 (Premier League)\n- Assists: 8\n- Hat-tricks: 5\n\nAchievements:\n- 2023 UEFA Champions League Winner\n- Premier League Golden Boot 2023\n\nStrengths:\n- Aerial ability, pace, and clinical finishing in the penalty box.\n- Known for his physicality and ability to dominate defenses.\n\nUpcoming Matches:\n- Manchester City vs. Liverpool - April 15, 2024\n- Manchester City vs. Chelsea - April 22, 2024.",
    "summary": "Erling Haaland, Manchester City's star forward, has scored 34 Premier League goals in the 2024 season, showcasing aerial dominance and finishing skills.",
    "name": "Erling Haaland Player Profile",
    "url": "./sharepoint/Haaland_Profile_2024.txt",
    "created_on": "2024-03-20",
    "updated_at": "2024-03-20",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Upcoming Tournaments in 2024:\n\n1. Copa Amrica 2024:\n   - Host: Ecuador\n   - Dates: June 14 to July 14\n   - Defending Champion: Argentina\n\n2. AFC Asian Cup 2024:\n   - Host: Qatar\n   - Dates: January 12 to February 10\n   - Key Teams: Japan, South Korea, Australia, Iran\n\n3. Africa Cup of Nations (AFCON) 2024:\n   - Host: Ivory Coast\n   - Dates: January 13 to February 11\n   - Defending Champion: Senegal\n\n4. UEFA Euro 2024:\n   - Host: Germany\n   - Dates: June 14 to July 14\n   - Key Teams: Italy, England, France, Spain.",
    "summary": "Major tournaments in 2024 include Copa Amrica in Ecuador, AFC Asian Cup in Qatar, AFCON in Ivory Coast, and UEFA Euro in Germany.",
    "name": "2024 Soccer Tournaments Overview",
    "url": "./sharepoint/2024_Tournaments.txt",
    "created_on": "2023-12-15",
    "updated_at": "2023-12-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },



  {
    "content": "The 2024 FIFA Men's World Cup will take place in Canada, Mexico, and the United States from June 8 to July 8. This will be the first time the tournament features 48 teams, expanding from the traditional 32-team format.\n\nKey Information:\n- Host Cities: Toronto, Vancouver, Mexico City, Monterrey, Guadalajara, New York, Los Angeles, and others.\n- Defending Champion: Argentina\n- Tournament Format: Group Stage followed by Knockout Rounds.\n\nFor ticket information and schedules, visit the official FIFA website.",
    "summary": "The 2024 FIFA Men's World Cup expands to 48 teams and will be hosted in Canada, Mexico, and the U.S. from June 8 to July 8.",
    "name": "FIFA 2024 World Cup Overview",
    "url": "./sharepoint/FIFA_2024_World_Cup.txt",
    "created_on": "2023-12-01",
    "updated_at": "2023-12-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Team Roster: FC Barcelona (2024)\n\nCoach: Xavi Hernandez\n\nStar Players:\n1. Robert Lewandowski - Forward\n2. Pedri - Midfielder\n3. Gavi - Midfielder\n4. Frenkie de Jong - Midfielder\n5. Marc-Andr ter Stegen - Goalkeeper\n\nNew Signings:\n- Joo Flix (On Loan) - Forward\n- Ilkay Gndoan - Midfielder\n\nLeague: Competing in La Liga, UEFA Champions League, and Copa del Rey.",
    "summary": "FC Barcelona's 2024 roster includes star players Lewandowski, Pedri, and Gavi. Competing in La Liga and UEFA Champions League.",
    "name": "FC Barcelona 2024 Roster",
    "url": "./sharepoint/FC_Barcelona_Roster_2024.txt",
    "created_on": "2024-01-05",
    "updated_at": "2024-01-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "UEFA Champions League 2024 - Group Stage Fixtures\n\nGroup A:\n1. Bayern Munich vs. Manchester United - September 18, 2024\n2. Galatasaray vs. Copenhagen - September 18, 2024\n\nGroup B:\n1. Real Madrid vs. Napoli - September 19, 2024\n2. Union Berlin vs. Braga - September 19, 2024\n\nOther Matches:\n- Inter Milan vs. Benfica - September 20, 2024\n- Arsenal vs. Paris Saint-Germain - September 20, 2024\n\nFor full fixtures, visit the official UEFA website.",
    "summary": "Key fixtures for the 2024 UEFA Champions League group stage include Bayern vs. Manchester United and Real Madrid vs. Napoli in September.",
    "name": "UEFA Champions League Fixtures",
    "url": "./sharepoint/Champions_League_Fixtures_2024.txt",
    "created_on": "2024-07-15",
    "updated_at": "2024-07-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Player Profile: Lionel Messi (2024)\n\nClub: Inter Miami CF (Major League Soccer)\n\nAchievements:\n- 7-time Ballon d'Or winner\n- 2022 FIFA World Cup Champion with Argentina\n- Record goal scorer for FC Barcelona and Argentina\n\nPlaying Style:\nKnown for his dribbling, vision, and precision finishing, Messi remains a dominant playmaker even in the latter stages of his career.\n\nCurrent Form:\n- Goals: 15 (2024 MLS season)\n- Assists: 10\n- Key Contributions: Led Inter Miami to the MLS playoffs for the first time.",
    "summary": "Lionel Messi, now at Inter Miami CF, continues to excel with 15 goals and 10 assists in the 2024 MLS season.",
    "name": "Lionel Messi Player Profile",
    "url": "./sharepoint/Messi_Profile_2024.txt",
    "created_on": "2024-05-10",
    "updated_at": "2024-05-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Match Report: Premier League 2024 - Arsenal vs. Manchester City\n\nDate: March 10, 2024\n\nFinal Score: Arsenal 2-1 Manchester City\n\nKey Highlights:\n- Arsenal's Bukayo Saka scored a stunning free-kick in the 45th minute.\n- Manchester City's Erling Haaland equalized in the 60th minute.\n- Gabriel Martinelli secured the win with a late goal in the 85th minute.\n\nMan of the Match:\n- Bukayo Saka (Arsenal) for his goal and playmaking contributions.\n\nImpact:\nThis win puts Arsenal at the top of the Premier League table, 3 points ahead of Manchester City.",
    "summary": "Arsenal defeated Manchester City 2-1 with goals from Bukayo Saka and Gabriel Martinelli, moving to the top of the Premier League table.",
    "name": "Premier League Match Report",
    "url": "./sharepoint/Arsenal_ManCity_Report.txt",
    "created_on": "2024-03-10",
    "updated_at": "2024-03-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },




  {
    "content": "The 2024 FIFA Men's World Cup will take place in Canada, Mexico, and the United States from June 8 to July 8. This will be the first time the tournament features 48 teams, expanding from the traditional 32-team format.\n\nKey Information:\n- Host Cities: Toronto, Vancouver, Mexico City, Monterrey, Guadalajara, New York, Los Angeles, and others.\n- Defending Champion: Argentina\n- Tournament Format: Group Stage followed by Knockout Rounds.\n\nFor ticket information and schedules, visit the official FIFA website.",
    "summary": "The 2024 FIFA Men's World Cup expands to 48 teams and will be hosted in Canada, Mexico, and the U.S. from June 8 to July 8.",
    "name": "FIFA 2024 World Cup Overview",
    "url": "./sharepoint/FIFA_2024_World_Cup.txt",
    "created_on": "2023-12-01",
    "updated_at": "2023-12-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Team Roster: FC Barcelona (2024)\n\nCoach: Xavi Hernandez\n\nStar Players:\n1. Robert Lewandowski - Forward\n2. Pedri - Midfielder\n3. Gavi - Midfielder\n4. Frenkie de Jong - Midfielder\n5. Marc-Andr ter Stegen - Goalkeeper\n\nNew Signings:\n- Joo Flix (On Loan) - Forward\n- Ilkay Gndoan - Midfielder\n\nLeague: Competing in La Liga, UEFA Champions League, and Copa del Rey.",
    "summary": "FC Barcelona's 2024 roster includes star players Lewandowski, Pedri, and Gavi. Competing in La Liga and UEFA Champions League.",
    "name": "FC Barcelona 2024 Roster",
    "url": "./sharepoint/FC_Barcelona_Roster_2024.txt",
    "created_on": "2024-01-05",
    "updated_at": "2024-01-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "UEFA Champions League 2024 - Group Stage Fixtures\n\nGroup A:\n1. Bayern Munich vs. Manchester United - September 18, 2024\n2. Galatasaray vs. Copenhagen - September 18, 2024\n\nGroup B:\n1. Real Madrid vs. Napoli - September 19, 2024\n2. Union Berlin vs. Braga - September 19, 2024\n\nOther Matches:\n- Inter Milan vs. Benfica - September 20, 2024\n- Arsenal vs. Paris Saint-Germain - September 20, 2024\n\nFor full fixtures, visit the official UEFA website.",
    "summary": "Key fixtures for the 2024 UEFA Champions League group stage include Bayern vs. Manchester United and Real Madrid vs. Napoli in September.",
    "name": "UEFA Champions League Fixtures",
    "url": "./sharepoint/Champions_League_Fixtures_2024.txt",
    "created_on": "2024-07-15",
    "updated_at": "2024-07-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Player Profile: Lionel Messi (2024)\n\nClub: Inter Miami CF (Major League Soccer)\n\nAchievements:\n- 7-time Ballon d'Or winner\n- 2022 FIFA World Cup Champion with Argentina\n- Record goal scorer for FC Barcelona and Argentina\n\nPlaying Style:\nKnown for his dribbling, vision, and precision finishing, Messi remains a dominant playmaker even in the latter stages of his career.\n\nCurrent Form:\n- Goals: 15 (2024 MLS season)\n- Assists: 10\n- Key Contributions: Led Inter Miami to the MLS playoffs for the first time.",
    "summary": "Lionel Messi, now at Inter Miami CF, continues to excel with 15 goals and 10 assists in the 2024 MLS season.",
    "name": "Lionel Messi Player Profile",
    "url": "./sharepoint/Messi_Profile_2024.txt",
    "created_on": "2024-05-10",
    "updated_at": "2024-05-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },
  {
    "content": "Match Report: Premier League 2024 - Arsenal vs. Manchester City\n\nDate: March 10, 2024\n\nFinal Score: Arsenal 2-1 Manchester City\n\nKey Highlights:\n- Arsenal's Bukayo Saka scored a stunning free-kick in the 45th minute.\n- Manchester City's Erling Haaland equalized in the 60th minute.\n- Gabriel Martinelli secured the win with a late goal in the 85th minute.\n\nMan of the Match:\n- Bukayo Saka (Arsenal) for his goal and playmaking contributions.\n\nImpact:\nThis win puts Arsenal at the top of the Premier League table, 3 points ahead of Manchester City.",
    "summary": "Arsenal defeated Manchester City 2-1 with goals from Bukayo Saka and Gabriel Martinelli, moving to the top of the Premier League table.",
    "name": "Premier League Match Report",
    "url": "./sharepoint/Arsenal_ManCity_Report.txt",
    "created_on": "2024-03-10",
    "updated_at": "2024-03-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "sports analyst"]
  },




  {
    "content": "Mn: L thuyt  th\n\n- M t: Khm ph cc khi nim c bn v ng dng ca l thuyt  th trong tin hc v thc t.\n- Ni dung chnh:\n  +  th c bn: nh, cnh,  th c hng, khng c hng.\n  + Cc bi ton  th: Tm ng i ngn nht (Dijkstra, Floyd-Warshall), tm cy khung nh nht (Prim, Kruskal).\n  +  th Euler v Hamilton.\n  + Phn tch  th mng v ng dng thc t.\n- ng dng thc t:\n  + Lp lch cng vic, mng my tnh.\n  + X l d liu trong h thng giao thng.\n  + Phn tch mng x hi.\n- iu kin tin quyt: Cu trc d liu v gii thut.",
    "summary": "L thuyt  th tp trung vo cc bi ton tm ng i, cy khung v ng dng thc t trong mng x hi, giao thng.",
    "name": "L thuyt  th",
    "url": "./courses/LyThuyetDoThi.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Mng my tnh\n\n- M t: Nghin cu cc nguyn l c bn ca mng my tnh v truyn thng d liu.\n- Ni dung chnh:\n  + Kin trc mng: OSI, TCP/IP.\n  + Giao thc mng: HTTP, FTP, DHCP, DNS.\n  + Qun l mng: Cu hnh router, switch, firewall.\n  + Bo mt mng: M ha, VPN, tng la.\n- ng dng thc t:\n  + Qun tr h thng mng doanh nghip.\n  + Xy dng v trin khai h thng truyn thng VoIP.\n  + Ti u ha h tng mng v bo mt.\n- iu kin tin quyt: H iu hnh.",
    "summary": "Mng my tnh cung cp kin thc v kin trc, giao thc v qun l mng  xy dng h thng truyn thng d liu.",
    "name": "Mng my tnh",
    "url": "./courses/MangMayTinh.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Lp trnh hng i tng\n\n- M t: Cung cp nn tng lp trnh hng i tng v ng dng trong pht trin phn mm.\n- Ni dung chnh:\n  + Cc khi nim c bn: Lp, i tng, k tha, a hnh.\n  + M hnh ha d liu v thit k UML.\n  + Thit k mu (Design Patterns): Singleton, Observer, Factory.\n  + Xy dng cc d n phn mm theo hng i tng.\n- ng dng thc t:\n  + Pht trin ng dng desktop, web.\n  + Thit k h thng qun l v c s d liu phc tp.\n  + Xy dng API v dch v backend.\n- iu kin tin quyt: Lp trnh c bn.",
    "summary": "Lp trnh hng i tng tp trung vo thit k phn mm thng qua cc khi nim lp, i tng, k tha, v mu thit k.",
    "name": "Lp trnh hng i tng",
    "url": "./courses/LapTrinhHuongDoiTuong.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Phn tch d liu ln\n\n- M t: Hc cc phng php thu thp, x l, v phn tch d liu ln bng cc cng c hin i.\n- Ni dung chnh:\n  + Nn tng d liu ln: Hadoop, Spark.\n  + K thut x l d liu: MapReduce, ETL.\n  + Phn tch d liu: Cluster, Classification.\n  + Trc quan ha d liu: Tableau, Power BI.\n- ng dng thc t:\n  + D on xu hng th trng.\n  + Xy dng h thng  xut.\n  + Phn tch d liu ngi dng trn cc nn tng mng x hi.\n- iu kin tin quyt: Ton cao cp, lp trnh Python.",
    "summary": "Phn tch d liu ln cung cp k nng x l, phn tch, v trc quan ha d liu trn nn tng hin i.",
    "name": "Phn tch d liu ln",
    "url": "./courses/PhanTichDuLieuLon.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Cng ngh phn mm nng cao\n\n- M t: Nghin cu cc phng php v cng c tin tin trong pht trin phn mm ln.\n- Ni dung chnh:\n  + Phn tch v thit k h thng ln.\n  + Qun l cu hnh phn mm.\n  + DevOps v tch hp lin tc.\n  + Kim th t ng v trin khai phn mm trn m my.\n- ng dng thc t:\n  + Pht trin ng dng web quy m ln.\n  + Tch hp cc gii php phn mm doanh nghip.\n  + ng dng cc cng ngh m my trong phn phi phn mm.\n- iu kin tin quyt: K thut phn mm.",
    "summary": "Cng ngh phn mm nng cao tp trung vo thit k, kim th v trin khai phn mm trn quy m ln.",
    "name": "Cng ngh phn mm nng cao",
    "url": "./courses/CongNghePhanMemNangCao.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },



  {
    "content": "Mn: Cu trc d liu v Gii thut\n\n- M t: Nghin cu cc cu trc d liu v gii thut c bn gip ti u ha chng trnh.\n- Ni dung chnh:\n  + Cu trc d liu c bn: Mng, danh sch lin kt, hng i, ngn xp.\n  + Cu trc nng cao: Cy nh phn,  th, bng bm.\n  + Gii thut: Tm kim, sp xp,  quy, chia  tr, tham lam, quy hoch ng.\n  + Phn tch  phc tp:  phc tp thi gian (O), khng gian (S).\n- ng dng thc t:\n  + Phn tch v x l d liu ln.\n  + Thit k phn mm hiu nng cao.\n  + ng dng trong tr tu nhn to.\n- iu kin tin quyt: Lp trnh c bn.",
    "summary": "Cu trc d liu v gii thut gip ti u ha chng trnh qua cc cu trc nh mng,  th, v gii thut tm kim/sp xp.",
    "name": "Cu trc d liu v Gii thut",
    "url": "./courses/CauTrucDuLieu.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: K thut phn mm\n\n- M t: Cung cp kin thc v phn tch, thit k, pht trin v kim th phn mm.\n- Ni dung chnh:\n  + Quy trnh pht trin phn mm: M hnh thc nc, Agile, Scrum.\n  + Cng c qun l d n: Jira, Trello.\n  + Kim th phn mm: Unit Test, Integration Test.\n  + Phn tch yu cu v thit k h thng: UML, ERD.\n- ng dng thc t:\n  + Qun l d n pht trin ng dng web/mobile.\n  + Kim th v trin khai phn mm doanh nghip.\n  + Tch hp cc dch v trn nn tng m my.\n- iu kin tin quyt: Lp trnh hng i tng.",
    "summary": "K thut phn mm tp trung vo quy trnh pht trin, kim th v trin khai phn mm ng dng.",
    "name": "K thut phn mm",
    "url": "./courses/KyThuatPhanMem.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: H iu hnh\n\n- M t: Tm hiu cc khi nim v c ch qun l ti nguyn trong h iu hnh.\n- Ni dung chnh:\n  + Qun l tin trnh: Lp lch, ng b ha, giao tip.\n  + Qun l b nh: Phn trang, phn on, b nh o.\n  + Qun l thit b v file: H thng file, I/O.\n  + An ninh v bo mt: a ngi dng, cp quyn truy cp.\n- ng dng thc t:\n  + Ti u ha h thng my ch.\n  + Thit k h iu hnh nhng cho thit b IoT.\n  + Qun tr v bo mt mng doanh nghip.\n- iu kin tin quyt: Kin thc lp trnh C v cu trc d liu.",
    "summary": "H iu hnh nghin cu cch qun l ti nguyn v bo mt trn cc nn tng my tnh.",
    "name": "H iu hnh",
    "url": "./courses/HeDieuHanh.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: Tr tu nhn to\n\n- M t: Khm ph cc khi nim v thut ton c bn trong lnh vc tr tu nhn to.\n- Ni dung chnh:\n  + Tm kim v ti u ha: BFS, DFS, A*.\n  + Hc my: Phn loi, hi quy.\n  + Lp lun v suy din: Lp k hoch, h chuyn gia.\n  + M hnh hc su: Mng n-ron nhn to.\n- ng dng thc t:\n  + Robot t hnh.\n  + H thng  xut (Netflix, Amazon).\n  + Chn on y t t ng.\n- iu kin tin quyt: Hc my c bn, k nng lp trnh Python.",
    "summary": "Tr tu nhn to nghin cu cc thut ton hc su, lp lun v ng dng trong robot, h thng  xut.",
    "name": "Tr tu nhn to",
    "url": "./courses/TriTueNhanTao.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: An ton thng tin\n\n- M t: Nghin cu cc k thut bo mt thng tin v qun l ri ro trong h thng cng ngh.\n- Ni dung chnh:\n  + M ha v gii m: RSA, AES, SHA.\n  + Tn cng mng: SQL Injection, Phishing.\n  + H thng pht hin v phng nga: IDS/IPS.\n  + Php lut v tiu chun bo mt: GDPR, ISO 27001.\n- ng dng thc t:\n  + Thit k h thng bo mt mng cho doanh nghip.\n  + nh gi ri ro v khc phc l hng bo mt.\n  + Bo v d liu c nhn trong ng dng di ng.\n- iu kin tin quyt: Mt m hc, h iu hnh.",
    "summary": "An ton thng tin tp trung vo bo mt d liu v qun l ri ro trong h thng cng ngh.",
    "name": "An ton thng tin",
    "url": "./courses/AnToanThongTin.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },




  {
    "content": "Mn: Hc my c bn\n\n- M t: Nghin cu cc thut ton v m hnh trong hc my nh hi quy tuyn tnh, hi quy logistic, SVM, cy quyt nh, v KNN.\n- Ni dung chnh:\n  + Ton hc c bn: i s tuyn tnh, xc sut thng k.\n  + Thut ton hc my: Gim st, khng gim st, bn gim st.\n  + nh gi m hnh: Precision, Recall, F1-score.\n- ng dng thc t:\n  + Phn loi email spam.\n  + Phn cm khch hng da trn d liu giao dch.\n  + D on gi bt ng sn.\n- iu kin tin quyt: Lp trnh Python v kin thc ton hc c bn.",
    "summary": "Hc my c bn dy v cc thut ton, m hnh v ng dng trong phn loi, phn cm v d on.",
    "name": "Hc my c bn",
    "url": "./courses/HocMayCoBan.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: X l ngn ng t nhin (NLP)\n\n- M t: Gii thiu cc k thut x l vn bn, phn tch ngn ng v xy dng h thng hiu ngn ng t nhin.\n- Ni dung chnh:\n  + Tin x l vn bn: Tokenization, stemming, lemmatization.\n  + Cc m hnh ngn ng: N-gram, LSTM, Transformer (BERT, GPT).\n  + ng dng NLP: Chatbot, tm kim thng tin, phn tch cm xc.\n- ng dng thc t:\n  + H thng tr l o (Siri, Google Assistant).\n  + Dch my (Google Translate).\n  + T ng tm tt ti liu.\n- iu kin tin quyt: Kin thc hc my v k nng lp trnh.",
    "summary": "NLP cung cp kin thc v x l vn bn v ng dng trong chatbot, dch my, v phn tch cm xc.",
    "name": "X l ngn ng t nhin",
    "url": "./courses/XuLyNgonNguTuNhien.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: Th gic my tnh\n\n- M t: Tm hiu cc cng ngh v k thut  phn tch v nhn dng hnh nh, video.\n- Ni dung chnh:\n  + X l hnh nh c bn: Lc nh, pht hin cnh, pht hin bin.\n  + Cc m hnh th gic: CNN, YOLO, Faster R-CNN.\n  + ng dng th gic: Nhn din khun mt, xe t hnh.\n- ng dng thc t:\n  + H thng gim st thng minh.\n  + ng dng AR/VR.\n  + Phn loi sn phm t ng trong nh my.\n- iu kin tin quyt: Kin thc hc su v lp trnh Python.",
    "summary": "Th gic my tnh hc v phn tch hnh nh/video v ng dng trong gim st, AR/VR, v xe t hnh.",
    "name": "Th gic my tnh",
    "url": "./courses/ThiGiacMayTinh.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: H thng vin thng\n\n- M t: Tm hiu nguyn l truyn thng v cng ngh trong h thng truyn tn hiu.\n- Ni dung chnh:\n  + Truyn tn hiu: Analog v s.\n  + Cc cng ngh: 4G, 5G, Wi-Fi, IoT.\n  + M hnh mng: OSI, TCP/IP.\n- ng dng thc t:\n  + Thit k h thng mng vin thng.\n  + Truyn pht trc tuyn.\n  + Giao tip IoT.\n- iu kin tin quyt: L thuyt tn hiu v x l s.",
    "summary": "H thng vin thng tp trung vo truyn tn hiu v cng ngh mng nh 5G, IoT.",
    "name": "H thng vin thng",
    "url": "./courses/HeThongVienThong.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },
  {
    "content": "Mn: Mt m hc\n\n- M t: Nghin cu cc thut ton bo mt v m ha  bo v d liu.\n- Ni dung chnh:\n  + Cc thut ton m ha: AES, RSA, DES.\n  + Qun l kha: Public Key, Private Key.\n  + ng dng m ha: SSL/TLS, ch k s.\n- ng dng thc t:\n  + Giao dch ngn hng an ton.\n  + Bo mt thng tin c nhn.\n  + H thng xc thc.\n- iu kin tin quyt: Kin thc ton hc c bn v l thuyt mng.",
    "summary": "Mt m hc cung cp kin thc v m ha d liu, qun l kha, v bo mt giao dch trc tuyn.",
    "name": "Mt m hc",
    "url": "./courses/MatMaHoc.txt",
    "category": "onedrive",
    "created_on": "2024-05-04",
    "updated_at": "2024-05-04"
  },





  {
    "content": "Tr tu nhn to v Hc my:\n\n1. Hc my c bn:\n   - M t: Gii thiu cc thut ton v m hnh hc my nh hi quy, phn loi, v cm.\n   - ng dng: Phn tch d liu, d bo ti chnh.\n\n2. X l ngn ng t nhin (NLP):\n   - M t: Nghin cu cc m hnh ngn ng v ng dng ca chng trong x l vn bn.\n   - ng dng: Chatbot, phn tch cm xc.\n\n3. Th gic my tnh:\n   - M t: Xy dng cc h thng nhn din hnh nh v video.\n   - ng dng: Nhn din khun mt, xe t hnh.",
    "summary": "Mn Tr tu nhn to gm hc my c bn, x l ngn ng t nhin, v th gic my tnh, tp trung vo ng dng cng ngh AI tin tin.",
    "name": "Cc mn Tr tu Nhn to ti UET",
    "url": "./sharepoint/MonTriTueNhanTao_UET.txt",
    "created_on": "2024-05-03",
    "updated_at": "2024-05-03",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "K thut in t - Vin thng:\n\n1. H thng vin thng:\n   - M t: Nghin cu cc nguyn l v cng ngh trong truyn thng khng dy v c dy.\n   - ng dng: Mng 5G, IoT.\n\n2. X l tn hiu s:\n   - M t: Cc phng php phn tch v x l tn hiu s.\n   - ng dng: Nn m thanh, x l hnh nh.\n\n3. Thit k vi mch:\n   - M t: Tm hiu quy trnh thit k v ch to vi mch tch hp.\n   - ng dng: Phn cng my tnh, thit b in t tiu dng.",
    "summary": "Mn in t - Vin thng gm h thng vin thng, x l tn hiu s, v thit k vi mch, vi ng dng trong truyn thng v phn cng.",
    "name": "Cc mn in t - Vin thng ti UET",
    "url": "./sharepoint/MonDienTuVienThong_UET.txt",
    "created_on": "2024-05-03",
    "updated_at": "2024-05-03",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "An ton thng tin:\n\n1. Mt m hc:\n   - M t: Tm hiu cc thut ton m ha v gii m d liu.\n   - ng dng: Bo mt giao dch trc tuyn, xc thc danh tnh.\n\n2. An ninh mng:\n   - M t: Cc k thut pht hin v ngn chn tn cng mng.\n   - ng dng: Tng la, h thng phng th mng.\n\n3. Phn tch m c:\n   - M t: Nghin cu cch nhn din v x l cc phn mm c hi.\n   - ng dng: Dit virus, bo v h thng.",
    "summary": "Mn An ton thng tin gm mt m hc, an ninh mng, v phn tch m c, nhn mnh bo mt h thng v d liu.",
    "name": "Cc mn An ton Thng tin ti UET",
    "url": "./sharepoint/MonAnToanThongTin_UET.txt",
    "created_on": "2024-05-03",
    "updated_at": "2024-05-03",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Cng ngh Phn mm:\n\n1. K ngh phn mm:\n   - M t: Gii thiu quy trnh pht trin phn mm t thit k n trin khai.\n   - ng dng: Pht trin ng dng, dch v web.\n\n2. Kim th phn mm:\n   - M t: Cc k thut kim tra v m bo cht lng phn mm.\n   - ng dng: Pht hin li, ti u hiu nng phn mm.\n\n3. Qun l phn mm:\n   - M t: Qun l d n phn mm, phn cng cng vic v gim st tin .\n   - ng dng: Agile, Scrum.",
    "summary": "Mn Cng ngh phn mm gm k ngh phn mm, kim th, v qun l d n, tp trung vo quy trnh pht trin v qun l.",
    "name": "Cc mn Cng ngh Phn mm ti UET",
    "url": "./sharepoint/MonCongNghePhanMem_UET.txt",
    "created_on": "2024-05-03",
    "updated_at": "2024-05-03",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Khoa hc D liu:\n\n1. Phn tch d liu ln:\n   - M t: K thut lu tr v x l d liu ln trn cc nn tng phn tn.\n   - ng dng: Phn tch th trng, d on hnh vi ngi dng.\n\n2. Hc su (Deep Learning):\n   - M t: Cc m hnh hc su nh mng n-ron, CNN, v RNN.\n   - ng dng: Nhn din ging ni, dch my.\n\n3. Trc quan ha d liu:\n   - M t: Biu din d liu thng qua  th v hnh nh trc quan.\n   - ng dng: Dashboard qun tr, bo co kinh doanh.",
    "summary": "Mn Khoa hc d liu gm phn tch d liu ln, hc su, v trc quan ha d liu, nhn mnh x l v biu din thng tin.",
    "name": "Cc mn Khoa hc D liu ti UET",
    "url": "./sharepoint/MonKhoaHocDuLieu_UET.txt",
    "created_on": "2024-05-03",
    "updated_at": "2024-05-03",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },




  {
    "content": "Cng Ngh Nano v Vt liu:\n\n1. Vt l cht rn:\n   - M t: Nghin cu tnh cht v cu trc ca vt liu  cp  nguyn t v phn t.\n   - ng dng: Thit k vt liu bn dn, pin nng lng mt tri.\n\n2. Cng ngh ch to nano:\n   - M t: Cc phng php ch to v phn tch vt liu nano.\n   - ng dng: Y hc nano, cm bin mi trng.\n\n3. Quang hc lng t:\n   - M t: Nghin cu cc hiu ng quang hc  cp  lng t.\n   - ng dng: Truyn thng quang hc, cng ngh laser.",
    "summary": "Mn Cng ngh Nano gm vt l cht rn, cng ngh ch to nano, v quang hc lng t, tp trung vo nghin cu v ng dng vt liu tin tin.",
    "name": "Cc mn Cng ngh Nano ti UET",
    "url": "./sharepoint/MonCongNgheNano_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "H Thng Thng Tin:\n\n1. C s d liu:\n   - M t: Gii thiu v thit k, qun l, v ti u ha c s d liu.\n   - ng dng: Qun tr h thng thng tin doanh nghip, phn tch d liu.\n\n2. Phn tch h thng:\n   - M t: Cc phng php phn tch v thit k h thng thng tin.\n   - ng dng: Xy dng phn mm qun l, h thng ERP.\n\n3. Qun l d n CNTT:\n   - M t: Lp k hoch, t chc v gim st cc d n cng ngh thng tin.\n   - ng dng: Trin khai d n cng ngh trong doanh nghip.",
    "summary": "Mn H Thng Thng Tin gm c s d liu, phn tch h thng, v qun l d n CNTT, nhn mnh vo t chc v qun l d liu.",
    "name": "Cc mn H Thng Thng Tin ti UET",
    "url": "./sharepoint/MonHeThongThongTin_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "K thut iu khin v T ng ha:\n\n1. iu khin t ng:\n   - M t: Nghin cu cc h thng iu khin hi tip, m hnh ha v thit k b iu khin.\n   - ng dng: Robot cng nghip, h thng t ng ha trong nh my.\n\n2. Tr tu nhn to trong iu khin:\n   - M t: ng dng AI  ti u ha h thng iu khin.\n   - ng dng: Xe t hnh, iu khin thit b thng minh.\n\n3. K thut o lng:\n   - M t: Cc phng php o lng v phn tch tn hiu.\n   - ng dng: H thng cm bin, thit b o lng cng nghip.",
    "summary": "Mn iu khin t ng bao gm iu khin t ng, tr tu nhn to trong iu khin, v k thut o lng, tp trung vo h thng v cm bin.",
    "name": "Cc mn K thut iu khin ti UET",
    "url": "./sharepoint/MonKyThuatDieuKhien_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Khoa hc Mi trng:\n\n1. a l v kh tng:\n   - M t: Tm hiu v h thng kh hu, d bo thi tit, v a l mi trng.\n   - ng dng: Quy hoch  th, qun l ti nguyn thin nhin.\n\n2. H thng thng tin a l (GIS):\n   - M t: S dng GIS  phn tch v trc quan ha d liu a l.\n   - ng dng: Qun l t ai, lp bn .\n\n3. Qun l cht lng mi trng:\n   - M t: Nghin cu cc phng php kim sot  nhim v bo v mi trng.\n   - ng dng: Kim sot cht thi, chnh sch bo v mi trng.",
    "summary": "Mn Khoa hc Mi trng gm a l v kh tng, h thng GIS, v qun l cht lng mi trng, tp trung vo nghin cu v bo v ti nguyn.",
    "name": "Cc mn Khoa hc Mi trng ti UET",
    "url": "./sharepoint/MonKhoaHocMoiTruong_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },




  {
    "content": "Cng Ngh Thng Tin (CNTT):\n\n1. Cu trc d liu v gii thut:\n   - M t: Gii thiu cc cu trc d liu c bn (danh sch, hng i, ngn xp, cy,  th) v cc thut ton x l trn .\n   - ng dng: Ti u ha phn mm, x l d liu ln.\n\n2. H iu hnh:\n   - M t: Nghin cu cc nguyn l hot ng ca h iu hnh, qun l ti nguyn, v x l song song.\n   - ng dng: Lp trnh h thng, pht trin phn mm nn tng.\n\n3. Tr tu nhn to (AI):\n   - M t: Cc k thut my hc, x l ngn ng t nhin, v mng n-ron.\n   - ng dng: Pht trin ng dng AI trong x l hnh nh, chatbot, v t ng ha.",
    "summary": "Mn CNTT gm cu trc d liu, h iu hnh, tr tu nhn to, tp trung vo k thut lp trnh v ng dng trong cng ngh.",
    "name": "Cc mn CNTT ti UET",
    "url": "./sharepoint/MonCNTT_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "K thut in t - Vin thng:\n\n1. L thuyt mch:\n   - M t: Nghin cu cc nguyn l c bn ca mch in, mch in t, v ng dng trong thit k h thng.\n   - ng dng: Thit k mch in cho thit b in t.\n\n2. H thng vin thng:\n   - M t: Tm hiu v truyn dn tn hiu, mng vin thng, v cng ngh khng dy.\n   - ng dng: Pht trin mng 5G, IoT.\n\n3. in t s:\n   - M t: Kin thc v logic s, mch s v cc ng dng trong thit k h thng nhng.\n   - ng dng: Thit k vi iu khin, h thng t ng ha.",
    "summary": "Mn k thut in t gm l thuyt mch, h thng vin thng, v in t s, tp trung vo thit k mch v cng ngh truyn dn.",
    "name": "Cc mn K thut in t - Vin thng ti UET",
    "url": "./sharepoint/MonDienTu_VienThong_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Khoa hc My tnh:\n\n1. Lp trnh nng cao:\n   - M t: Tm hiu cc ngn ng lp trnh hin i (C++, Python, Java) v cc k thut ti u ha m ngun.\n   - ng dng: Pht trin phn mm, ng dng di ng.\n\n2. Khoa hc d liu:\n   - M t: Cung cp kin thc v phn tch d liu, m hnh ha v trc quan ha d liu.\n   - ng dng: D liu ln, AI, v phn tch kinh doanh.\n\n3. An ton thng tin:\n   - M t: Cc k thut bo mt, m ha, v bo v d liu.\n   - ng dng: Pht trin h thng an ton, bo v quyn ring t.",
    "summary": "Mn khoa hc my tnh gm lp trnh nng cao, khoa hc d liu, v an ton thng tin, nhn mnh vo phn tch v bo mt.",
    "name": "Cc mn Khoa hc My tnh ti UET",
    "url": "./sharepoint/MonKhoaHocMayTinh_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Ton Tin ng Dng:\n\n1. i s tuyn tnh:\n   - M t: Nghin cu cc php bin i tuyn tnh, ma trn v ng dng trong x l d liu.\n   - ng dng: Hc my, th gic my tnh.\n\n2. Ti u ha:\n   - M t: Cc phng php ti u ha tuyn tnh v phi tuyn tnh, ng dng trong lp k hoch.\n   - ng dng: Ti u ha chui cung ng, thit k thut ton.\n\n3. Phng trnh vi phn:\n   - M t: Nghin cu cc phng php gii phng trnh vi phn, ng dng trong vt l v k thut.\n   - ng dng: M phng h thng, k thut.",
    "summary": "Mn Ton tin ng dng gm i s tuyn tnh, ti u ha v phng trnh vi phn, cung cp nn tng ton hc cho k thut v khoa hc.",
    "name": "Cc mn Ton Tin ti UET",
    "url": "./sharepoint/MonToanTin_UET.txt",
    "created_on": "2024-05-02",
    "updated_at": "2024-05-02",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },




  {
    "content": "Lch S Th Gii Hin i:\n\n1. Cch mng Cng nghip:\n   - c im: Bt u ti Anh vo th k 18 vi s pht trin ca my mc v ngnh cng nghip dt may.\n   - H qu: Tng trng kinh t,  th ha v ci thin i sng nhng cng gy  nhim v bt bnh ng.\n\n2. Cch mng Php (1789-1799):\n   - Nguyn nhn: Bt cng x hi, khng hong kinh t v nh hng ca t tng khai sng.\n   - Kt qu: Lt  ch  qun ch, thnh lp nn Cng ha, lan ta t tng dn ch khp chu u.\n\n3. Thi k Thuc a:\n   - c im: Cc cng quc chu u xm chim v khai thc ti nguyn ti chu , chu Phi v chu M.\n   - H qu: Hnh thnh h thng kinh t ton cu nhng gy ra p bc v bc lt ti cc thuc a.",
    "summary": "Lch s hin i tp trung vo Cch mng Cng nghip, Cch mng Php, v thi k thuc a, nhn mnh cc tc ng kinh t, x hi v chnh tr.",
    "name": "Lch S Hin i",
    "url": "./sharepoint/LichSuHienDai.txt",
    "created_on": "2024-04-20",
    "updated_at": "2024-04-20",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },
  {
    "content": "Nhng Thnh Tu Vn Minh Vit Nam:\n\n1. Vn ha ng Sn:\n   - c im: K thut c ng pht trin vi cc hin vt nh trng ng ng Sn.\n   - Vai tr: nh du s pht trin rc r ca c dn Vit c.\n\n2. Vn hc thi L - Trn:\n   - Tc phm tiu biu: \"Nam quc sn h\" (L Thng Kit), cc b s k v vn hc Pht gio.\n   - c im: Kt hp tinh thn yu nc v t tng Pht gio.\n\n3. Kin trc thi Nguyn:\n   - Cng trnh tiu biu: Kinh thnh Hu, cc lng tm hong gia.\n   - c im: S ha quyn gia kin trc truyn thng Vit Nam v phong cch chu .",
    "summary": "Cc thnh tu vn minh Vit Nam bao gm vn ha ng Sn, vn hc thi L - Trn, v kin trc thi Nguyn.",
    "name": "Thnh Tu Vn Minh Vit Nam",
    "url": "./sharepoint/ThanhTuuVanMinhVietNam.txt",
    "created_on": "2024-04-25",
    "updated_at": "2024-04-25",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },
  {
    "content": "Lch S ng Nam :\n\n1.  ch Srivijaya:\n   - c im: Mt vng quc hng mnh ti Indonesia (th k 7-13), kim sot tuyn ng thng mi bin ng Nam .\n   - ng gp: Lan ta vn ha Hindu v Pht gio trong khu vc.\n\n2.  ch Khmer:\n   - c im: Pht trin mnh t th k 9-15 vi trung tm l Angkor Wat.\n   - H qu:  li du n trong kin trc v tn gio ti Campuchia v cc quc gia ln cn.\n\n3. Phong tro ginh c lp:\n   - c im: Cc quc gia ng Nam  chng li ch thng tr ca thc dn chu u vo th k 20.\n   - Kt qu: Thnh lp cc quc gia c lp nh Vit Nam, Indonesia, v Myanmar.",
    "summary": "Lch s ng Nam  bao gm  ch Srivijaya, Khmer v phong tro ginh c lp trong th k 20.",
    "name": "Lch S ng Nam ",
    "url": "./sharepoint/LichSuDongNamA.txt",
    "created_on": "2024-04-30",
    "updated_at": "2024-04-30",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },
  {
    "content": "Nhng Nhn Vt Lch S Ni Ting:\n\n1. Alexander i :\n   - Thnh tu: Chinh phc mt  ch tri di t Hy Lp n n .\n   - Di sn: Lan ta vn ha Hy Lp n cc vng t rng ln.\n\n2. Nguyn Tri (Vit Nam):\n   - Thnh tu: Tham gia lnh o khng chin chng Minh, tc gi ca \"Bnh Ng i co\".\n   - Vai tr: Mt nh chnh tr, qun s v nh th ln ca Vit Nam.\n\n3. Mahatma Gandhi (n ):\n   - Thnh tu: Lnh o phong tro ginh c lp n  bng phng php bt bo ng.\n   - Di sn: Truyn cm hng cho cc phong tro dn quyn trn ton th gii.",
    "summary": "Cc nhn vt lch s ni ting bao gm Alexander i , Nguyn Tri v Mahatma Gandhi, vi cc thnh tu v qun s, chnh tr v x hi.",
    "name": "Nhn Vt Lch S",
    "url": "./sharepoint/NhanVatLichSu.txt",
    "created_on": "2024-05-01",
    "updated_at": "2024-05-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },




  {
    "content": "Lch S Th Gii C i:\n\n1. Nn vn minh Lng H:\n   - c im: Hnh thnh ti Lng H (Iraq ngy nay) vi cc thnh tu v lut php (B lut Hammurabi), ch vit (ch hnh nm).\n\n2. Nn vn minh Ai Cp:\n   - c im: Pht trin dc sng Nile, ni bt vi cc kim t thp v ch tng hnh.\n\n3. Nn vn minh Hy Lp:\n   - c im: ng gp ln v trit hc, khoa hc v ngh thut; ni ting vi cc thnh bang nh Athens v Sparta.\n\n4. Nn vn minh La M:\n   - c im:  ch rng ln vi nh hng lu di v lut php, kin trc v chnh tr.",
    "summary": "Khi qut v lch s th gii c i, bao gm cc nn vn minh Lng H, Ai Cp, Hy Lp v La M.",
    "name": "Lch S C i",
    "url": "./sharepoint/LichSuCoDai.txt",
    "created_on": "2024-04-01",
    "updated_at": "2024-04-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },
  {
    "content": "Lch S Vit Nam:\n\n1. Thi k Vn Lang - u Lc:\n   - S kin chnh: Nh nc u tin ca ngi Vit c hnh thnh, vi cc vua Hng v th  Phong Chu.\n\n2. Thi k Bc thuc:\n   - S kin chnh: Vit Nam nm di s  h ca cc triu i Trung Hoa trong hn 1000 nm.\n\n3. Thi k c lp:\n   - Nh Ng, inh, Tin L: t nn tng cho nh nc phong kin c lp.\n   - Nh L, Trn: Pht trin vn ha, gio dc, v nh bi cc cuc xm lc ca Mng Nguyn.\n\n4. Thi k hin i:\n   - Cch mng Thng Tm (1945): Thnh lp nc Vit Nam Dn ch Cng ha.\n   - Chin tranh chng Php v M, thng nht t nc (1975).",
    "summary": "Lch s Vit Nam t thi Vn Lang - u Lc n thi hin i, bao gm cc giai on Bc thuc, phong kin c lp v cch mng.",
    "name": "Lch S Vit Nam",
    "url": "./sharepoint/LichSuVietNam.txt",
    "created_on": "2024-04-05",
    "updated_at": "2024-04-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },
  {
    "content": "Lch S Trung C:\n\n1. Chu u thi Trung C:\n   - c im: S pht trin ca ch  phong kin v Gio hi Cng gio.\n   - S kin: Cuc Thp T chinh, s pht trin ca cc thnh th.\n\n2. Thi k Hi gio hong kim:\n   - c im: Thnh tu vt bc v khoa hc, y hc, v kin trc ti cc quc gia Hi gio.\n\n3. Chu  thi Trung C:\n   - c im: Thnh vng ca cc triu i ln nh nh ng, nh Tng  Trung Quc.\n\n4. Chu M trc khi Columbus n:\n   - c im: Nn vn minh Maya, Aztec v Inca pht trin mnh vi cc thnh tu v nng nghip, kin trc.",
    "summary": "Lch s Trung C bao gm s pht trin ca phong kin chu u, Hi gio hong kim, cc triu i chu , v nn vn minh chu M trc thi thuc a.",
    "name": "Lch S Trung C",
    "url": "./sharepoint/LichSuTrungCo.txt",
    "created_on": "2024-04-10",
    "updated_at": "2024-04-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },
  {
    "content": "Cc Cuc Chin Tranh Ln Trong Lch S:\n\n1. Chin tranh Th gii th Nht (19141918):\n   - Nguyn nhn: Cc lin minh qun s, ch ngha  quc, v s kin m st Archduke Franz Ferdinand.\n   - Kt qu: S sp  ca cc  ch ln, hnh thnh Hi Quc Lin.\n\n2. Chin tranh Th gii th Hai (19391945):\n   - Nguyn nhn: S tri dy ca ch ngha pht xt, khng hong kinh t ton cu.\n   - Kt qu: Hnh thnh Lin Hp Quc, Chin tranh Lnh gia M v Lin X.\n\n3. Chin tranh Lnh (19471991):\n   - c im: i u  thc h gia M v Lin X, vi cc cuc chin y nhim.\n\n4. Chin tranh Vit Nam (19551975):\n   - c im: Cuc chin gia min Bc v min Nam Vit Nam, c s can thip ca M.",
    "summary": "Tng quan v cc cuc chin tranh ln trong lch s nh Chin tranh Th gii th Nht, th Hai, Chin tranh Lnh, v Chin tranh Vit Nam.",
    "name": "Cc Cuc Chin Tranh Ln",
    "url": "./sharepoint/CacCuocChienTranhLon.txt",
    "created_on": "2024-04-15",
    "updated_at": "2024-04-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "researcher"]
  },





  {
    "content": "H Thng Chnh Tr Vit Nam:\n\n1. ng Cng sn Vit Nam (CSVN):\n   - Vai tr: L ng chnh tr duy nht lnh o t nc.\n   - Nguyn tc hot ng: Tp trung dn ch, lnh o ton din.\n\n2. Quc hi:\n   - Vai tr: C quan quyn lc nh nc cao nht, lp php.\n   - Thnh phn: i biu quc hi c bu t cc tnh thnh.\n\n3. Chnh ph:\n   - Vai tr: C quan hnh php cao nht.\n   - Lnh o: Th tng Chnh ph, cng cc b trng v thnh vin khc.\n\n4. y ban Nhn dn (UBND) v Hi ng Nhn dn (HND):\n   - Vai tr: Qun l hnh chnh  cp a phng.\n   - Thnh phn: Cc i din do dn bu ti cp tnh, huyn, x.\n\n5. Ch tch nc:\n   - Vai tr: Ngi ng u nh nc, i din i ni v i ngoi.\n   - Quyn hn: Ph chun cc quyt nh ca Quc hi v Chnh ph.",
    "summary": "Tng quan h thng chnh tr Vit Nam bao gm ng Cng sn Vit Nam, Quc hi, Chnh ph, UBND/HND, v Ch tch nc.",
    "name": "H Thng Chnh Tr Vit Nam",
    "url": "./sharepoint/HeThongChinhTriVietNam.txt",
    "created_on": "2024-03-20",
    "updated_at": "2024-03-20",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "Lch S Chnh Tr Vit Nam Hin i:\n\n1. Giai on 19451954:\n   - S kin chnh: Cch mng thng Tm (1945), thnh lp nc Vit Nam Dn ch Cng ha.\n   - Cuc khng chin chng Php kt thc bng chin thng in Bin Ph (1954).\n\n2. Giai on 19541975:\n   - S kin chnh: Chia ct hai min Nam - Bc ti Hip nh Genve.\n   - Cuc khng chin chng M dn n thng nht t nc (1975).\n\n3. Giai on 19761986:\n   - S kin chnh: Thnh lp nc Cng ha X hi Ch ngha Vit Nam (1976).\n   - Kh khn kinh t, thc hin k hoch ha tp trung.\n\n4. Giai on 1986 n nay:\n   - i mi (1986): Ci cch kinh t, chuyn sang kinh t th trng nh hng XHCN.\n   - Hi nhp quc t: Gia nhp ASEAN (1995), WTO (2007).",
    "summary": "Lch s chnh tr hin i Vit Nam bao gm cc giai on cch mng, khng chin, thng nht t nc, v i mi kinh t.",
    "name": "Lch S Chnh Tr Vit Nam",
    "url": "./sharepoint/LichSuChinhTriVietNam.txt",
    "created_on": "2024-03-22",
    "updated_at": "2024-03-22",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "Cc Vn Kin Quan Trng ca ng v Nh nc Vit Nam:\n\n1. Hin php 1946:\n   - Vai tr: Bn hin php u tin ca Vit Nam, t nn tng cho nh nc php quyn.\n\n2. Hin php 1992 (Sa i 2013):\n   - Vai tr: nh hnh r hn vai tr ca kinh t th trng v hi nhp quc t.\n\n3. Cng lnh Xy dng t nc (1991, b sung 2011):\n   - Ni dung: nh hng pht trin kinh t, x hi v chnh tr di hn.\n\n4. Vn kin i hi ng ton quc:\n   - Vai tr: Xc nh cc chin lc, mc tiu v phng hng lnh o trong tng giai on 5 nm.",
    "summary": "Tng hp cc vn kin quan trng ca ng v Nh nc, bao gm Hin php 1946, 1992, Cng lnh 1991, v vn kin i hi ng.",
    "name": "Cc Vn Kin Chnh Tr Vit Nam",
    "url": "./sharepoint/VanKienChinhTriVietNam.txt",
    "created_on": "2024-03-25",
    "updated_at": "2024-03-25",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "Chnh Sch Ngoi Giao ca Vit Nam:\n\n1. Chnh sch i ngoi ha bnh:\n   - Cam kt: Khng can thip vo cng vic ni b ca quc gia khc, tn trng ch quyn.\n\n2. a phng ha v a dng ha:\n   - Mc tiu: Xy dng quan h hp tc vi nhiu quc gia v t chc quc t.\n\n3. Hi nhp kinh t quc t:\n   - Thnh tu: Gia nhp WTO, k kt cc FTA ln nh CPTPP, EVFTA.\n\n4. Gn gi ha bnh:\n   - ng gp: Tham gia cc phi b gn gi ha bnh ca Lin Hp Quc.\n\n5. Quan h vi cc nc ln:\n   - i tc: Duy tr quan h cn bng gia cc cng quc nh M, Trung Quc, Nga, EU.",
    "summary": "Chnh sch ngoi giao ca Vit Nam tp trung vo ha bnh, a phng ha, hi nhp kinh t, gn gi ha bnh, v quan h vi cc nc ln.",
    "name": "Chnh Sch Ngoi Giao Vit Nam",
    "url": "./sharepoint/ChinhSachNgoaiGiaoVietNam.txt",
    "created_on": "2024-03-28",
    "updated_at": "2024-03-28",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },



  {
    "content": "Major Political Systems in the World:\n\n1. Democracy:\n   - Characteristics: Citizens have the right to vote and participate in decision-making.\n   - Examples: United States, India, France.\n\n2. Authoritarianism:\n   - Characteristics: Power concentrated in a single leader or party with limited public participation.\n   - Examples: North Korea, Saudi Arabia.\n\n3. Socialism:\n   - Characteristics: Economic and social policies emphasizing state ownership and equality.\n   - Examples: Cuba, Venezuela.\n\n4. Monarchy:\n   - Characteristics: Rule by a king or queen, either constitutional (limited powers) or absolute.\n   - Examples: United Kingdom (constitutional), Saudi Arabia (absolute).\n\n5. Federalism:\n   - Characteristics: Power divided between central and regional governments.\n   - Examples: United States, Germany.",
    "summary": "Overview of political systems including democracy, authoritarianism, socialism, monarchy, and federalism with examples of countries.",
    "name": "Political Systems Overview",
    "url": "./sharepoint/Political_Systems.txt",
    "created_on": "2024-02-10",
    "updated_at": "2024-02-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "Major Political Events of the 21st Century:\n\n1. Arab Spring (20102012):\n   - A series of pro-democracy uprisings in the Middle East and North Africa.\n   - Impact: Regime changes in Tunisia, Egypt, and Libya; ongoing conflicts in Syria and Yemen.\n\n2. Brexit (20162020):\n   - The United Kingdom's decision to leave the European Union.\n   - Impact: Political and economic shifts in Europe.\n\n3. U.S. Presidential Elections (2008, 2016, 2020):\n   - Significant elections that reflected changing political landscapes in the U.S.\n   - Key Figures: Barack Obama, Donald Trump, Joe Biden.\n\n4. Rise of Populism:\n   - Increasing popularity of populist leaders in Europe and the Americas.\n   - Examples: Leaders in Hungary, Brazil, and Italy.\n\n5. Global Climate Agreements:\n   - Paris Agreement (2015): Global commitment to combat climate change.\n   - Impact: Shifts in energy policies and international cooperation.",
    "summary": "Key political events include the Arab Spring, Brexit, U.S. elections, rise of populism, and global climate agreements.",
    "name": "Major Political Events",
    "url": "./sharepoint/Political_Events_21st_Century.txt",
    "created_on": "2024-01-15",
    "updated_at": "2024-01-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "Key International Organizations and Their Roles:\n\n1. United Nations (UN):\n   - Focus: Peacekeeping, human rights, and sustainable development.\n   - Agencies: WHO (health), UNICEF (children), UNHCR (refugees).\n\n2. NATO (North Atlantic Treaty Organization):\n   - Focus: Collective defense and security.\n   - Members: Primarily North American and European nations.\n\n3. European Union (EU):\n   - Focus: Economic and political integration in Europe.\n   - Initiatives: Single market, common currency (Euro).\n\n4. World Bank and IMF:\n   - Focus: Economic development and financial stability.\n   - Activities: Loans, policy advice, and financial aid for developing countries.\n\n5. African Union (AU):\n   - Focus: Promoting unity, peace, and economic development in Africa.",
    "summary": "Overview of major international organizations, including the UN, NATO, EU, World Bank/IMF, and African Union, and their primary roles.",
    "name": "International Organizations Overview",
    "url": "./sharepoint/International_Organizations.txt",
    "created_on": "2024-03-01",
    "updated_at": "2024-03-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "Types of Political Ideologies:\n\n1. Liberalism:\n   - Emphasis on individual freedoms, democracy, and free markets.\n   - Prominent Figures: John Locke, Adam Smith.\n\n2. Conservatism:\n   - Focus on tradition, social stability, and gradual change.\n   - Prominent Figures: Edmund Burke, Margaret Thatcher.\n\n3. Socialism:\n   - Advocates for social ownership and economic equality.\n   - Prominent Figures: Karl Marx, Bernie Sanders.\n\n4. Nationalism:\n   - Focus on promoting national interests and identity.\n   - Examples: Independence movements, patriotic policies.\n\n5. Environmentalism:\n   - Advocates for policies to protect the environment and combat climate change.\n   - Organizations: Greenpeace, Extinction Rebellion.",
    "summary": "Key political ideologies include liberalism, conservatism, socialism, nationalism, and environmentalism, each with distinct principles and goals.",
    "name": "Political Ideologies",
    "url": "./sharepoint/Political_Ideologies.txt",
    "created_on": "2024-02-05",
    "updated_at": "2024-02-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },
  {
    "content": "How to Stay Informed About Politics:\n\n1. Follow Reliable News Sources:\n   - Examples: BBC, Reuters, Al Jazeera, The New York Times.\n   - Cross-check information from multiple outlets.\n\n2. Use onedriveal Platforms:\n   - Examples: Khan Academy, Coursera, and Udemy offer courses on political science and onedrive.\n\n3. Engage with Political Discussions:\n   - Join forums, attend debates, or participate in local political events.\n   - Respect differing opinions to foster productive conversations.\n\n4. Read Books and Publications:\n   - Examples: \"The Federalist Papers,\" \"The Communist Manifesto,\" and modern analyses like \"Why Nations Fail.\"\n\n5. Follow Government and NGO Updates:\n   - Visit official websites or social onedrive channels for updates.\n   - Examples: White House, European Commission, United Nations.",
    "summary": "Tips for staying politically informed include following reliable news, using onedeiveal platforms, engaging in discussions, reading key texts, and tracking government updates.",
    "name": "Staying Informed About Politics",
    "url": "./sharepoint/Stay_Informed_Politics.txt",
    "created_on": "2024-03-15",
    "updated_at": "2024-03-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "analyst"]
  },




  {
    "content": "Top Universities in 2024 (Global Rankings):\n\n1. Massachusetts Institute of onedrive (MIT):\n   - Renowned for engineering, onedrive, and science programs.\n   - Located in Cambridge, USA.\n\n2. Stanford University:\n   - Strong focus on onedrive, onedrive, and medical research.\n   - Located in Stanford, USA.\n\n3. University of Oxford:\n   - Famous for humanities, law, and medical sciences.\n   - Located in Oxford, UK.\n\n4. University of Cambridge:\n   - Excels in natural sciences, engineering, and arts.\n   - Located in Cambridge, UK.\n\n5. ETH Zurich:\n   - Known for cutting-edge research in engineering and onedrive.\n   - Located in Zurich, Switzerland.",
    "summary": "Top universities in 2024 include MIT, Stanford, Oxford, Cambridge, and ETH Zurich, known for excellence in various fields of study.",
    "name": "Top Universities 2024",
    "url": "./sharepoint/Top_Universities_2024.txt",
    "created_on": "2024-02-20",
    "updated_at": "2024-02-20",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "How to Choose the Right University:\n\n1. Identify Your Priorities:\n   - Consider factors like location, tuition costs, and available programs.\n   - Evaluate campus facilities and extracurricular activities.\n\n2. Research Academic Programs:\n   - Look for universities with strong departments in your area of interest.\n   - Review course curriculums and faculty expertise.\n\n3. Check Rankings and Accreditation:\n   - Consult global and national rankings for insights.\n   - Ensure the university is accredited by recognized institutions.\n\n4. Visit Campuses (If Possible):\n   - Attend open days or virtual tours.\n   - Interact with current students and professors.\n\n5. Consider Financial Aid Options:\n   - Explore scholarships, grants, and work-study opportunities.\n   - Compare the total cost of attendance, including living expenses.",
    "summary": "Tips for choosing a university include identifying priorities, researching programs, checking rankings, visiting campuses, and considering financial aid options.",
    "name": "Choosing the Right University",
    "url": "./sharepoint/Choosing_University.txt",
    "created_on": "2024-01-25",
    "updated_at": "2024-01-25",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Common University Majors and Career Paths:\n\n1. Computer Science:\n   - Careers: Software engineer, data scientist, cybersecurity analyst.\n   - Skills: Programming, algorithms, and systems design.\n\n2. onedrive Administration:\n   - Careers: Marketing manager, financial analyst, entrepreneur.\n   - Skills: Leadership, communication, and strategic planning.\n\n3. Engineering:\n   - Careers: Civil engineer, mechanical engineer, aerospace engineer.\n   - Skills: Problem-solving, technical expertise, and design.\n\n4. Medicine:\n   - Careers: Doctor, surgeon, medical researcher.\n   - Skills: Patient care, diagnostics, and medical ethics.\n\n5. Psychology:\n   - Careers: Clinical psychologist, counselor, human resources specialist.\n   - Skills: Research, interpersonal communication, and analysis.",
    "summary": "Popular university majors include Computer Science, onedrive Administration, Engineering, Medicine, and Psychology, each leading to specific career paths.",
    "name": "University Majors and Careers",
    "url": "./sharepoint/Majors_and_Careers.txt",
    "created_on": "2024-02-05",
    "updated_at": "2024-02-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Scholarship Resources for University Students:\n\n1. Government Scholarships:\n   - Examples: Fulbright, Chevening, Erasmus+.\n   - Usually cover tuition, travel, and living expenses.\n\n2. University-Specific Scholarships:\n   - Many universities offer merit-based and need-based aid.\n   - Check the university's financial aid office for opportunities.\n\n3. Private Foundations:\n   - Organizations like the Gates Foundation or Rotary International provide funding.\n   - Often target specific fields of study or underserved communities.\n\n4. Industry-Sponsored Scholarships:\n   - Tech companies like Google or Microsoft fund STEM scholarships.\n   - Check with professional organizations in your field.\n\n5. Local Community Grants:\n   - Smaller awards from local onedrivees or charities.\n   - Often less competitive but highly impactful.",
    "summary": "Scholarship resources include government programs, university aid, private foundations, industry sponsors, and local grants.",
    "name": "University Scholarship Resources",
    "url": "./sharepoint/Scholarship_Resources.txt",
    "created_on": "2023-12-15",
    "updated_at": "2023-12-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Tips for Freshmen Starting University:\n\n1. Attend Orientation Programs:\n   - Helps familiarize yourself with campus resources and meet peers.\n\n2. Manage Your Time Wisely:\n   - Use a planner to keep track of classes, assignments, and extracurriculars.\n\n3. Build Relationships with Professors:\n   - Attend office hours and ask questions to deepen understanding.\n\n4. Get Involved on Campus:\n   - Join clubs, organizations, or sports teams to expand your network.\n\n5. Take Care of Your Health:\n   - Balance academics with regular exercise, a healthy diet, and sufficient sleep.",
    "summary": "Tips for university freshmen include attending orientation, managing time, building relationships with professors, getting involved on campus, and maintaining health.",
    "name": "University Freshmen Tips",
    "url": "./sharepoint/Freshmen_Tips.txt",
    "created_on": "2024-01-01",
    "updated_at": "2024-01-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },




  {
    "content": "Study Tips for University Students:\n\n1. Create a Study Schedule:\n   - Allocate specific times for studying each subject.\n   - Include regular breaks to improve focus.\n\n2. Use Active Learning Techniques:\n   - Summarize key points in your own words.\n   - Practice past exam papers and solve problems.\n\n3. Optimize Your Study Environment:\n   - Find a quiet, well-lit space.\n   - Minimize distractions by turning off notifications.\n\n4. Join Study Groups:\n   - Collaborate with peers to share knowledge.\n   - Discuss complex topics to deepen understanding.\n\n5. Take Care of Yourself:\n   - Get 7-8 hours of sleep each night.\n   - Maintain a balanced diet and stay hydrated.",
    "summary": "Tips for effective studying include creating a schedule, using active learning techniques, optimizing your environment, joining study groups, and prioritizing self-care.",
    "name": "University Study Tips",
    "url": "./sharepoint/University_Study_Tips.txt",
    "created_on": "2024-02-10",
    "updated_at": "2024-02-10",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Online Learning Platforms (2024):\n\n1. Coursera:\n   - Offers courses from top universities like Stanford and Harvard.\n   - Includes professional certificates and degrees.\n\n2. Udemy:\n   - Features a wide range of courses at affordable prices.\n   - Topics range from programming to personal development.\n\n3. Khan Academy:\n   - Provides free resources for K-12 onedrive.\n   - Focuses on math, science, and test prep.\n\n4. edX:\n   - Partners with institutions like MIT and Oxford.\n   - Offers MicroMasters and professional tracks.\n\n5. Duolingo:\n   - Specializes in language learning with gamified lessons.\n   - Supports over 40 languages.",
    "summary": "Top online learning platforms in 2024 include Coursera, Udemy, Khan Academy, edX, and Duolingo, offering diverse topics and certifications.",
    "name": "Online Learning Platforms 2024",
    "url": "./sharepoint/Online_Learning_2024.txt",
    "created_on": "2024-03-01",
    "updated_at": "2024-03-01",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Productivity Tools for Students:\n\n1. Notion:\n   - Organize notes, tasks, and schedules in one place.\n   - Customizable templates for project management.\n\n2. Grammarly:\n   - Helps with grammar, spelling, and writing clarity.\n   - Useful for essays, emails, and research papers.\n\n3. Quizlet:\n   - Create digital flashcards for memorization.\n   - Use practice tests and games to reinforce learning.\n\n4. Google Workspace:\n   - Tools like Docs, Sheets, and Slides for collaboration.\n   - Cloud storage via Google Drive.\n\n5. Forest App:\n   - Encourages focus by growing virtual trees while you work.\n   - Prevents distractions from your phone.",
    "summary": "Top productivity tools for students include Notion for organization, Grammarly for writing, Quizlet for memorization, Google Workspace for collaboration, and Forest App for focus.",
    "name": "Productivity Tools for Students",
    "url": "./sharepoint/Productivity_Tools.txt",
    "created_on": "2024-01-15",
    "updated_at": "2024-01-15",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Scholarship Opportunities (2024):\n\n1. Fulbright Scholarship:\n   - For international students pursuing master's or Ph.D. programs in the US.\n   - Covers tuition, living expenses, and travel costs.\n\n2. Chevening Scholarship:\n   - For students pursuing one-year master's degrees in the UK.\n   - Fully funded by the UK government.\n\n3. DAAD Scholarship:\n   - For postgraduate courses in Germany.\n   - Includes monthly stipends and travel allowances.\n\n4. Rhodes Scholarship:\n   - For postgraduate studies at the University of Oxford.\n   - Open to students from specific countries.\n\n5. Erasmus+:\n   - Offers funding for study and internships in Europe.\n   - Available for undergraduate, master's, and doctoral students.",
    "summary": "Top scholarships in 2024 include Fulbright, Chevening, DAAD, Rhodes, and Erasmus+, covering various countries and academic levels.",
    "name": "Scholarship Opportunities 2024",
    "url": "./sharepoint/Scholarships_2024.txt",
    "created_on": "2023-12-20",
    "updated_at": "2023-12-20",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },
  {
    "content": "Common Challenges in Learning and How to Overcome Them:\n\n1. Procrastination:\n   - Break tasks into smaller steps.\n   - Use time management techniques like Pomodoro.\n\n2. Lack of Motivation:\n   - Set clear, achievable goals.\n   - Reward yourself for completing milestones.\n\n3. Difficulty Understanding Material:\n   - Seek clarification from teachers or peers.\n   - Use supplementary resources like online tutorials.\n\n4. Test Anxiety:\n   - Practice relaxation techniques like deep breathing.\n   - Prepare thoroughly with past exam papers.\n\n5. Balancing Study and Life:\n   - Create a daily routine that includes time for hobbies and rest.\n   - Avoid overloading your schedule.",
    "summary": "Overcome common learning challenges like procrastination, lack of motivation, and test anxiety by setting goals, managing time, and using relaxation techniques.",
    "name": "Learning Challenges and Solutions",
    "url": "./sharepoint/Learning_Challenges.txt",
    "created_on": "2024-01-05",
    "updated_at": "2024-01-05",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["demo", "student"]
  },



  {
    "content": "Mn: Hnh hc vi phn\n\n- M t: Nghin cu hnh hc ca cc a tp, bao gm cc khi nim v o hm, metric v ng cong trong khng gian Euclid v khng gian khng Euclid.\n- Ni dung chnh:\n  + a tp v khng gian chiu cao.\n  + o hm v  cong ca ng cong.\n  + Tch phn ng v din tch trong khng gian.\n  + Cc nh l trong hnh hc vi phn: nh l Gauss-Bonnet.\n- ng dng thc t:\n  + M phng hnh hc trong  ha my tnh.\n  + Phn tch cu trc khng gian trong vt l l thuyt.\n  + To m hnh ng hc trong k thut.\n- iu kin tin quyt: Gii tch II, i s tuyn tnh.",
    "summary": "Hnh hc vi phn nghin cu hnh hc ca cc a tp v ng dng trong m phng  ha, vt l l thuyt v k thut.",
    "name": "Hnh hc vi phn",
    "url": "./courses/HinhHocViPhan.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Phn tch hm\n\n- M t: Nghin cu cc tnh cht ca hm, bao gm s lin tc, kh vi, hi t ca chui v cc tch phn khng xc nh.\n- Ni dung chnh:\n  + S hi t ca chui v chui s.\n  + Cc phng php kim tra hi t.\n  + Tnh lin tc, kh vi v cc nh l c bn v hm.\n  + Hm s v ng dng trong l thuyt xc sut v l thuyt thng k.\n- ng dng thc t:\n  + Phn tch tn hiu trong x l tn hiu s.\n  + D on v phn tch d liu trong khoa hc my tnh.\n  + X l tn hiu v phn tch h thng trong k thut.\n- iu kin tin quyt: Gii tch II, Ton cao cp.",
    "summary": "Phn tch hm nghin cu cc tnh cht ca hm s, chui hi t v ng dng trong x l tn hiu v phn tch d liu.",
    "name": "Phn tch hm",
    "url": "./courses/PhanTichHam.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: L thuyt  th\n\n- M t: Nghin cu cc c tnh v thut ton lin quan n  th, bao gm cc vn  v tm kim, duyt  th v ng dng trong khoa hc my tnh v mng.\n- Ni dung chnh:\n  + Cc thut ton tm kim trong  th: BFS, DFS.\n  +  th c trng s, thut ton Dijkstra.\n  +  th hng v  th v hng: c im v ng dng.\n  + Cc bi ton  th trong ti u ha v phn tch mng.\n- ng dng thc t:\n  + Phn tch mng x hi, phn tch lin kt trong web.\n  + Ti u ha cc mng my tnh v giao thng.\n  + Lp trnh v phn tch thut ton trong khoa hc my tnh.\n- iu kin tin quyt: Ton ri rc, i s tuyn tnh.",
    "summary": "L thuyt  th nghin cu cc thut ton v bi ton ti u trong cc  th v ng dng trong mng my tnh v phn tch d liu.",
    "name": "L thuyt  th",
    "url": "./courses/LyThuyetDoThi.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Ton hc ng dng\n\n- M t: Nghin cu cc ng dng ton hc trong cc lnh vc nh vt l, k thut v khoa hc my tnh. Tp trung vo vic p dng l thuyt ton hc vo gii quyt cc bi ton thc tin.\n- Ni dung chnh:\n  + Phng trnh vi phn ng dng trong c hc v vt l.\n  + Phn tch ng dng trong l thuyt iu khin v ti u ha.\n  + Cc m hnh ton hc trong khoa hc my tnh v k thut.\n  + M phng h thng ng lc hc v phn tch m hnh.\n- ng dng thc t:\n  + M phng cc h thng vt l trong c hc v in hc.\n  + Ti u ha v m phng trong k thut v kinh t.\n  + ng dng trong phn tch d liu v hc my.\n- iu kin tin quyt: Gii tch II, i s tuyn tnh.",
    "summary": "Ton hc ng dng tp trung vo vic p dng cc khi nim ton hc vo cc bi ton thc t trong vt l, k thut v khoa hc my tnh.",
    "name": "Ton hc ng dng",
    "url": "./courses/ToanHocUngDung.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Phng php s\n\n- M t: Nghin cu cc phng php s  gii quyt cc bi ton ton hc phc tp khng th gii quyt bng phng php phn tch.\n- Ni dung chnh:\n  + Phng php phn tch sai s v tnh chnh xc ca cc thut ton.\n  + Gii phng trnh bng phng php s: Newton, phng php phn r LU.\n  + X l ma trn v h phng trnh tuyn tnh.\n  + Cc bi ton ti u ha v phng php s trong gii tch.\n- ng dng thc t:\n  + Gii quyt cc bi ton khoa hc trong vt l v k thut.\n  + X l d liu v ti u ha thut ton trong khoa hc my tnh.\n  + M phng h thng v gii cc bi ton khoa hc trong y hc.\n- iu kin tin quyt: Gii tch II, i s tuyn tnh.",
    "summary": "Phng php s cung cp cc k thut v thut ton  gii quyt cc bi ton ton hc phc tp khng th gii quyt bng phn tch l thuyt.",
    "name": "Phng php s",
    "url": "./courses/PhuongPhapSo.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },




  {
    "content": "Mn: Phng trnh vi phn\n\n- M t: Nghin cu cc phng trnh vi phn v ng dng ca chng trong m hnh ha cc qu trnh vt l, sinh hc v k thut.\n- Ni dung chnh:\n  + Phng trnh vi phn bc nht: Gii php v ng dng.\n  + Phng trnh vi phn bc hai v bc cao hn: Cc phng php gii v ng dng.\n  + H phng trnh vi phn: Phng php gii v phn tch.\n  + Phng trnh vi phn trong c hc, in hc v sinh hc.\n- ng dng thc t:\n  + M hnh ha ng lc hc, dng chy cht lng.\n  + Phn tch h thng ng lc hc trong k thut.\n  + M phng v phn tch qu trnh sinh hc.\n- iu kin tin quyt: Gii tch II, Ton cao cp.",
    "summary": "Phng trnh vi phn nghin cu cc phng trnh lin quan n s thay i ca cc i lng trong qu trnh vt l v sinh hc.",
    "name": "Phng trnh vi phn",
    "url": "./courses/PhuongTrinhViPhan.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Hnh hc i s\n\n- M t: Nghin cu cc khi nim hnh hc t gc  i s, bao gm khng gian affine, khng gian projective, v cc phng trnh i s m t cc i tng hnh hc.\n- Ni dung chnh:\n  + Khng gian affine v projective.\n  + Cc ng cong i s v l thuyt m hnh ha hnh hc.\n  + Cc nhm Lie v l thuyt nhm trong hnh hc i s.\n  + ng dng hnh hc i s trong l thuyt m v l thuyt thng tin.\n- ng dng thc t:\n  + M hnh ha i tng trong my tnh v  ha 3D.\n  + Ti u ha m ha v bo mt thng tin.\n  + Cc bi ton ti u trong kinh t hc v k thut.\n- iu kin tin quyt: i s tuyn tnh, Ton cao cp.",
    "summary": "Hnh hc i s nghin cu cc i tng hnh hc qua cc khi nim i s v ng dng trong ti u ha v bo mt thng tin.",
    "name": "Hnh hc i s",
    "url": "./courses/HinhHocDaiSo.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Ton ri rc\n\n- M t: Nghin cu cc cu trc ton hc ri rc, bao gm l thuyt  th, l thuyt nhm, v cc bi ton ti u ha.\n- Ni dung chnh:\n  + S hc v l thuyt  th:  th Euler, Hamilton.\n  + L thuyt nhm v i s tru tng.\n  + Cc thut ton tm kim v ti u ha trong l thuyt ri rc.\n  + Phng php tnh ton v cc ng dng thc t.\n- ng dng thc t:\n  + M hnh ha v ti u ha cc mng my tnh v h thng phn tn.\n  + Phn tch thut ton trong khoa hc my tnh.\n  + Gii quyt bi ton ti u ha trong kinh t hc.\n- iu kin tin quyt: i s tuyn tnh, Ton cp 3.",
    "summary": "Ton ri rc nghin cu cc cu trc ton hc ri rc v ng dng trong ti u ha, mng my tnh v khoa hc my tnh.",
    "name": "Ton ri rc",
    "url": "./courses/ToanRoiRac.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: L thuyt xc sut v thng k\n\n- M t: Nghin cu cc khi nim nng cao v l thuyt xc sut, cc phn phi xc sut v phng php thng k p dng trong phn tch d liu ln.\n- Ni dung chnh:\n  + Xc sut iu kin v l thuyt Bayes.\n  + Phn phi xc sut phc tp v ng dng trong phn tch d liu.\n  + Cc phng php kim nh gi thuyt v c lng thng k.\n  + Phn tch hi quy v m hnh thng k.\n- ng dng thc t:\n  + D on xu hng ti chnh v phn tch d liu ln.\n  + X l v phn tch d liu trong khoa hc y t v nghin cu x hi.\n  + Phn tch d liu trong hc my v AI.\n- iu kin tin quyt: Xc sut v thng k.",
    "summary": "L thuyt xc sut v thng k nng cao nghin cu cc phn phi phc tp v phng php kim nh, ng dng trong phn tch d liu ln v hc my.",
    "name": "L thuyt xc sut v thng k",
    "url": "./courses/LyThuyetXacSuatThongKe.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Ti u ha ton hc\n\n- M t: Nghin cu cc phng php ti u ha, t ti u ha tuyn tnh n ti u ha phi tuyn v cc ng dng thc t.\n- Ni dung chnh:\n  + Phng php ti u ha tuyn tnh: Phng trnh v bt ng thc tuyn tnh.\n  + Ti u ha phi tuyn: Phng php gradient, phng php Newton.\n  + Ti u ha trong cc h thng phc tp.\n  + Cc phng php ti u ha trong l thuyt iu khin v kinh t hc.\n- ng dng thc t:\n  + Ti u ha quy trnh sn xut trong cng nghip.\n  + Phn tch v ti u ha h thng nng lng.\n  + Ti u ha mng li v giao thng.\n- iu kin tin quyt: i s tuyn tnh, Ton cao cp.",
    "summary": "Ti u ha ton hc nghin cu cc phng php ti u ha tuyn tnh v phi tuyn trong cc h thng v ng dng thc t.",
    "name": "Ti u ha ton hc",
    "url": "./courses/ToiUuHoaToanHoc.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },




  {
    "content": "Mn: Phng trnh vi phn\n\n- M t: Nghin cu cc phng trnh vi phn v ng dng ca chng trong m hnh ha cc qu trnh vt l, sinh hc v k thut.\n- Ni dung chnh:\n  + Phng trnh vi phn bc nht: Gii php v ng dng.\n  + Phng trnh vi phn bc hai v bc cao hn: Cc phng php gii v ng dng.\n  + H phng trnh vi phn: Phng php gii v phn tch.\n  + Phng trnh vi phn trong c hc, in hc v sinh hc.\n- ng dng thc t:\n  + M hnh ha ng lc hc, dng chy cht lng.\n  + Phn tch h thng ng lc hc trong k thut.\n  + M phng v phn tch qu trnh sinh hc.\n- iu kin tin quyt: Gii tch II, Ton cao cp.",
    "summary": "Phng trnh vi phn nghin cu cc phng trnh lin quan n s thay i ca cc i lng trong qu trnh vt l v sinh hc.",
    "name": "Phng trnh vi phn",
    "url": "./courses/PhuongTrinhViPhan.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Hnh hc i s\n\n- M t: Nghin cu cc khi nim hnh hc t gc  i s, bao gm khng gian affine, khng gian projective, v cc phng trnh i s m t cc i tng hnh hc.\n- Ni dung chnh:\n  + Khng gian affine v projective.\n  + Cc ng cong i s v l thuyt m hnh ha hnh hc.\n  + Cc nhm Lie v l thuyt nhm trong hnh hc i s.\n  + ng dng hnh hc i s trong l thuyt m v l thuyt thng tin.\n- ng dng thc t:\n  + M hnh ha i tng trong my tnh v  ha 3D.\n  + Ti u ha m ha v bo mt thng tin.\n  + Cc bi ton ti u trong kinh t hc v k thut.\n- iu kin tin quyt: i s tuyn tnh, Ton cao cp.",
    "summary": "Hnh hc i s nghin cu cc i tng hnh hc qua cc khi nim i s v ng dng trong ti u ha v bo mt thng tin.",
    "name": "Hnh hc i s",
    "url": "./courses/HinhHocDaiSo.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Ton ri rc\n\n- M t: Nghin cu cc cu trc ton hc ri rc, bao gm l thuyt  th, l thuyt nhm, v cc bi ton ti u ha.\n- Ni dung chnh:\n  + S hc v l thuyt  th:  th Euler, Hamilton.\n  + L thuyt nhm v i s tru tng.\n  + Cc thut ton tm kim v ti u ha trong l thuyt ri rc.\n  + Phng php tnh ton v cc ng dng thc t.\n- ng dng thc t:\n  + M hnh ha v ti u ha cc mng my tnh v h thng phn tn.\n  + Phn tch thut ton trong khoa hc my tnh.\n  + Gii quyt bi ton ti u ha trong kinh t hc.\n- iu kin tin quyt: i s tuyn tnh, Ton cp 3.",
    "summary": "Ton ri rc nghin cu cc cu trc ton hc ri rc v ng dng trong ti u ha, mng my tnh v khoa hc my tnh.",
    "name": "Ton ri rc",
    "url": "./courses/ToanRoiRac.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: L thuyt xc sut v thng k\n\n- M t: Nghin cu cc khi nim nng cao v l thuyt xc sut, cc phn phi xc sut v phng php thng k p dng trong phn tch d liu ln.\n- Ni dung chnh:\n  + Xc sut iu kin v l thuyt Bayes.\n  + Phn phi xc sut phc tp v ng dng trong phn tch d liu.\n  + Cc phng php kim nh gi thuyt v c lng thng k.\n  + Phn tch hi quy v m hnh thng k.\n- ng dng thc t:\n  + D on xu hng ti chnh v phn tch d liu ln.\n  + X l v phn tch d liu trong khoa hc y t v nghin cu x hi.\n  + Phn tch d liu trong hc my v AI.\n- iu kin tin quyt: Xc sut v thng k.",
    "summary": "L thuyt xc sut v thng k nng cao nghin cu cc phn phi phc tp v phng php kim nh, ng dng trong phn tch d liu ln v hc my.",
    "name": "L thuyt xc sut v thng k",
    "url": "./courses/LyThuyetXacSuatThongKe.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Ti u ha ton hc\n\n- M t: Nghin cu cc phng php ti u ha, t ti u ha tuyn tnh n ti u ha phi tuyn v cc ng dng thc t.\n- Ni dung chnh:\n  + Phng php ti u ha tuyn tnh: Phng trnh v bt ng thc tuyn tnh.\n  + Ti u ha phi tuyn: Phng php gradient, phng php Newton.\n  + Ti u ha trong cc h thng phc tp.\n  + Cc phng php ti u ha trong l thuyt iu khin v kinh t hc.\n- ng dng thc t:\n  + Ti u ha quy trnh sn xut trong cng nghip.\n  + Phn tch v ti u ha h thng nng lng.\n  + Ti u ha mng li v giao thng.\n- iu kin tin quyt: i s tuyn tnh, Ton cao cp.",
    "summary": "Ti u ha ton hc nghin cu cc phng php ti u ha tuyn tnh v phi tuyn trong cc h thng v ng dng thc t.",
    "name": "Ti u ha ton hc",
    "url": "./courses/ToiUuHoaToanHoc.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },





  {
    "content": "Mn: Gii tch I\n\n- M t: Cung cp kin thc c bn v gii hn, o hm, v tch phn ca hm s mt bin.\n- Ni dung chnh:\n  + Gii hn v lin tc: nh ngha v cc tnh cht c bn.\n  + o hm:  ngha hnh hc, quy tc o hm, v ng dng.\n  + Tch phn xc nh v bt nh: nh ngha, cc phng php tnh tch phn.\n  + ng dng ca tch phn: Tnh din tch, th tch v cc bi ton thc t.\n- ng dng thc t:\n  + M hnh ha cc h thng vt l.\n  + Ti u ha trong kinh t v k thut.\n  + Phn tch d liu khoa hc.\n- iu kin tin quyt: Ton cp 3 (lp 12).",
    "summary": "Gii tch I gii thiu cc khi nim c bn v gii hn, o hm v tch phn ca hm s mt bin.",
    "name": "Gii tch I",
    "url": "./courses/GiaiTich1.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: i s tuyn tnh\n\n- M t: Nghin cu cc khi nim v ng dng ca ma trn, khng gian vector v h phng trnh tuyn tnh.\n- Ni dung chnh:\n  + Ma trn v nh thc: Tnh ton, tnh cht v ng dng.\n  + H phng trnh tuyn tnh: Cch gii v ng dng thc t.\n  + Khng gian vector: C s, chiu, v nh x tuyn tnh.\n  + Gi tr ring v vector ring: ng dng trong khoa hc v k thut.\n- ng dng thc t:\n  + Phn tch d liu ln v hc my.\n  + X l tn hiu v hnh nh.\n  + M hnh ha h thng ng lc hc.\n- iu kin tin quyt: Ton cp 3 (hnh hc khng gian, i s).",
    "summary": "i s tuyn tnh tp trung vo ma trn, khng gian vector v ng dng trong khoa hc d liu v k thut.",
    "name": "i s tuyn tnh",
    "url": "./courses/DaiSoTuyenTinh.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Xc sut v thng k\n\n- M t: Cung cp cc khi nim c bn v xc sut, thng k v ng dng trong phn tch d liu.\n- Ni dung chnh:\n  + Xc sut c bn: Khng gian mu, bin c, quy tc tnh xc sut.\n  + Bin ngu nhin: Hm mt , k vng, phng sai.\n  + Phn phi xc sut: Chun, nh thc, Poisson.\n  + Thng k: Ly mu, kim nh gi thuyt, phn tch hi quy.\n- ng dng thc t:\n  + Phn tch d liu trong kinh doanh v khoa hc.\n  + D on xu hng trong hc my.\n  + nh gi ri ro trong ti chnh.\n- iu kin tin quyt: Ton cao cp hoc ton cp 3.",
    "summary": "Xc sut v thng k cung cp kin thc v phn phi, bin ngu nhin, kim nh gi thuyt, v ng dng trong phn tch d liu.",
    "name": "Xc sut v thng k",
    "url": "./courses/XacSuatThongKe.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: Gii tch II\n\n- M t: M rng kin thc ca Gii tch I vi cc khi nim v tch phn nhiu bin v ng dng.\n- Ni dung chnh:\n  + Hm nhiu bin: Gii hn, o hm ring, v gradient.\n  + Tch phn kp v tch phn bi ba: K thut tnh ton v ng dng.\n  + Tch phn ng v tch phn mt:  ngha vt l v ng dng.\n  + nh l Green, Stokes v Gauss: ng dng trong vt l v k thut.\n- ng dng thc t:\n  + M hnh ha v phn tch trong c hc v k thut.\n  + Thit k h thng nng lng v mi trng.\n  + Phn tch dng chy trong kh ng hc.\n- iu kin tin quyt: Gii tch I.",
    "summary": "Gii tch II m rng kin thc vi tch phn nhiu bin, tch phn ng, v ng dng trong vt l v k thut.",
    "name": "Gii tch II",
    "url": "./courses/GiaiTich2.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },
  {
    "content": "Mn: L thuyt s\n\n- M t: Nghin cu cc tnh cht v ng dng ca s nguyn trong ton hc v khoa hc my tnh.\n- Ni dung chnh:\n  + S nguyn t v phn tch tha s nguyn t.\n  + L thuyt ng d: H phng trnh ng d, nh l nh Fermat.\n  + Cc nh l s hc: nh l Euler, nh l Lagrange.\n  + ng dng: Mt m hc, m ha RSA.\n- ng dng thc t:\n  + Bo mt thng tin v truyn d liu.\n  + Gii quyt cc bi ton trong mt m v bo mt mng.\n  + Ti u ha thut ton trong lp trnh.\n- iu kin tin quyt: i s tuyn tnh, ton cao cp.",
    "summary": "L thuyt s nghin cu tnh cht s nguyn v ng dng trong mt m v bo mt thng tin.",
    "name": "L thuyt s",
    "url": "./courses/LyThuyetSo.txt",
    "category": "onedrive",
    "created_on": "2024-05-05",
    "updated_at": "2024-05-05"
  },




  {
    "content": "Thi k Hng Vng (2879258 TCN) l giai on u tin trong lch s Vit Nam. y l thi k cc vua Hng lp nn nh nc Vn Lang vi kinh  ti Phong Chu. Vn Lang c xy dng trn nn tng nng nghip la nc, vi t chc x hi n gin v i sng tinh thn phong ph. Truyn thuyt Sn Tinh  Thy Tinh, bnh chng bnh dy u bt ngun t thi k ny.",
    "summary": "Thi k Hng Vng (2879258 TCN): Nh nc Vn Lang c thnh lp, nn nng nghip la nc pht trin, v cc truyn thuyt ni ting ra i.",
    "name": "Thi k Hng Vng",
    "url": "./onedrive/hung_vuong_period.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Nh Nguyn c thnh lp nm 1802 di triu vua Gia Long v kt thc vo nm 1945 vi s thoi v ca vua Bo i. y l triu i phong kin cui cng ca Vit Nam. Thi k ny chng kin s giao thoa vn ha ng - Ty, ng thi cng chu p lc t s xm lc ca thc dn Php. Nh Nguyn c nhiu thnh tu v kin trc nh Kinh thnh Hu, ng thi cng phi i mt vi nhiu cuc khi ngha chng Php.",
    "summary": "Nh Nguyn (18021945): Triu i phong kin cui cng, chng kin giao thoa vn ha v s xm lc ca thc dn Php.",
    "name": "Nh Nguyn",
    "url": "./onedrive/nguyen_dynasty.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Thi k khng chin chng Php (19451954) bt u khi H Ch Minh tuyn b c lp v thnh lp nc Vit Nam Dn ch Cng ha vo ngy 2 thng 9 nm 1945. Sau , cuc khng chin bng n do Php ti xm lc. Kt qu ca cuc chin l chin thng in Bin Ph nm 1954, buc Php k Hip nh Genve v cng nhn nn c lp ca Vit Nam.",
    "summary": "Khng chin chng Php (19451954): Vit Nam ginh c lp vi chin thng in Bin Ph v Hip nh Genve.",
    "name": "Khng chin chng Php",
    "url": "./onedrive/anti_french_resistance.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Chin tranh Vit Nam (19551975) l cuc xung t qun s gia Vit Nam Dn ch Cng ha v Vit Nam Cng ha, vi s can thip ln t Hoa K. y l mt trong nhng cuc chin khc lit nht trong lch s hin i, dn n s thng nht t nc sau chin thng ca qun i min Bc v s sp  ca chnh quyn Si Gn vo ngy 30 thng 4 nm 1975.",
    "summary": "Chin tranh Vit Nam (19551975): Cuc chin gia min Bc v min Nam, kt thc vi chin thng ngy 30/4/1975 v thng nht t nc.",
    "name": "Chin tranh Vit Nam",
    "url": "./onedrive/vietnam_war.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "i mi kinh t (1986nay) l thi k quan trng trong lch s hin i ca Vit Nam, khi ng Cng sn Vit Nam a ra chnh sch i mi ti i hi VI. Cc ci cch kinh t  chuyn i t nn kinh t tp trung bao cp sang nn kinh t th trng nh hng x hi ch ngha. Vit Nam  t c nhiu thnh tu ng k v tng trng kinh t, xa i gim ngho, v hi nhp quc t.",
    "summary": "i mi kinh t (1986nay): Chuyn i t bao cp sang kinh t th trng, gip tng trng kinh t v hi nhp quc t.",
    "name": "i mi kinh t",
    "url": "./onedrive/economic_reform.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },



  
  {
    "content": "Premier League, gii bng  hng u ca Anh, c thnh lp vo nm 1992, thay th First Division. Gii u c 20 i tham gia v l mt trong nhng gii u hp dn nht th gii, vi lng ngi xem ton cu ln. Cc cu lc b ni ting nh Manchester United, Liverpool, Manchester City, Chelsea, v Arsenal thng xuyn cnh tranh chc v ch. Ma gii ko di t thng 8 n thng 5, vi cc i chi theo th thc vng trn lt i v lt v.",
    "summary": "Premier League (t 1992): Gii bng  hng u nc Anh, gm 20 i, vi nhng cu lc b hng u th gii nh Manchester United, Liverpool, Chelsea.",
    "name": "Gii thiu Premier League",
    "url": "./sports/premier_league_introduction.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Manchester United l cu lc b thnh cng nht lch s Premier League vi 13 chc v ch k t khi gii u bt u vo nm 1992. Di s dn dt ca Sir Alex Ferguson, i bng  xy dng  ch huy hong v ginh nhiu danh hiu ln. Cc cu th huyn thoi nh Ryan Giggs, Paul Scholes, v Cristiano Ronaldo tng khoc o cu lc b ny.",
    "summary": "Manchester United: Cu lc b thnh cng nht Premier League vi 13 chc v ch, ni bt di thi Sir Alex Ferguson.",
    "name": "Manchester United trong Premier League",
    "url": "./sports/manchester_united_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Manchester City, di s qun l ca HLV Pep Guardiola,  thng tr Premier League trong thp k qua, ginh 5 chc v ch t ma gii 2011-2012 n 2022-2023. i bng ni bt vi li chi kim sot bng v kh nng tn cng mnh m, cng nhng ngi sao nh Kevin De Bruyne, Erling Haaland, v Riyad Mahrez.",
    "summary": "Manchester City: Thng tr Premier League gn y vi 5 chc v ch di thi Pep Guardiola v i hnh mnh m.",
    "name": "Manchester City trong Premier League",
    "url": "./sports/manchester_city_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Liverpool, mt trong nhng cu lc b giu truyn thng nht Premier League,  ginh chc v ch ma gii 2019-2020 di s dn dt ca HLV Jrgen Klopp, chm dt 30 nm khng v ch quc ni. Vi li chi pressing mnh m v cc ngi sao nh Mohamed Salah, Sadio Man, v Virgil van Dijk, Liverpool  tr thnh i th nng k trong cuc ua v ch.",
    "summary": "Liverpool: i bng giu truyn thng, v ch Premier League ma 2019-2020 sau 30 nm ch i.",
    "name": "Liverpool trong Premier League",
    "url": "./sports/liverpool_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Arsenal, di thi HLV Arsne Wenger, ni ting vi thnh tch 'Invincibles' ma gii 2003-2004, khi i bng bt bi ton b 38 trn. y l k lc cha tng c trong lch s Premier League. Vi trit l bng  tn cng p mt, Arsenal  xy dng mt giai on hong kim, nhng i bng gp kh khn trong vic duy tr s thng tr k t .",
    "summary": "Arsenal: Ni bt vi ma gii 'Invincibles' 2003-2004 bt bi, k lc c nht Premier League.",
    "name": "Arsenal trong Premier League",
    "url": "./sports/arsenal_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },






  {
    "content": "Premier League hin ti bao gm 20 i bng tranh ti trong mt ma gii ko di t thng 8 n thng 5. Mi i s thi u 38 trn (lt i v lt v), tng cng 380 trn mi ma gii. Ba i xp cui bng s b xung hng Championship, v ba i t Championship s c thng hng.",
    "summary": "Premier League: Gm 20 i, mi i chi 38 trn mi ma; 3 i cui bng xung hng Championship.",
    "name": "Cu trc gii u Premier League",
    "url": "./sports/premier_league_structure.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Chelsea l mt trong nhng cu lc b thnh cng nht Premier League, vi 5 ln v ch k t nm 1992. Di thi HLV Jos Mourinho, Chelsea  ginh 2 chc v ch lin tip vo cc ma gii 2004-2005 v 2005-2006, thit lp mt k nguyn mi cho i bng.",
    "summary": "Chelsea: Ginh 5 chc v ch Premier League, ni bt di thi Jos Mourinho vi 2 ma v ch lin tip.",
    "name": "Chelsea trong Premier League",
    "url": "./sports/chelsea_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Leicester City  to nn cu chuyn c tch khi v ch Premier League ma gii 2015-2016. Di s dn dt ca HLV Claudio Ranieri, Leicester, vi t l cc v ch ban u l 5000/1,  nh bi mi d on  ginh danh hiu u tin trong lch s i bng.",
    "summary": "Leicester City: i v ch bt ng ma 2015-2016 vi t l cc 5000/1, to nn cu chuyn c tch bng .",
    "name": "Leicester City trong Premier League",
    "url": "./sports/leicester_city_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Premier League  chng kin nhng tay sn bn huyn thoi. Alan Shearer dn u danh sch mi thi i vi 260 bn thng. Cc cu th ni bt khc bao gm Thierry Henry, Wayne Rooney, v Sergio Agero, nhng ngi  ghi du n khng th phai m trong lch s gii u.",
    "summary": "Cc huyn thoi ghi bn: Alan Shearer dn u vi 260 bn; Thierry Henry, Wayne Rooney v Sergio Agero cng ni bt.",
    "name": "Nhng huyn thoi ghi bn Premier League",
    "url": "./sports/premier_league_top_scorers.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Premier League khng ch l gii u trong nc m cn l mt sn phm ton cu, c pht sng ti hn 200 quc gia v vng lnh th. Vi lng ngi xem c tnh hn 3 t ngi mi ma, y l gii u c theo di nhiu nht th gii.",
    "summary": "Premier League: Gii u ton cu vi hn 3 t ngi xem mi ma, pht sng ti hn 200 quc gia.",
    "name": "Tm nh hng ton cu ca Premier League",
    "url": "./sports/premier_league_global_reach.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Tottenham Hotspur, mt i bng truyn thng ca Premier League,  ginh ngi  qun vo ma gii 2016-2017 di s dn dt ca HLV Mauricio Pochettino. Harry Kane, tin o ch lc ca i,  ginh nhiu danh hiu Vua ph li v l biu tng ca cu lc b.",
    "summary": "Tottenham:  qun ma 2016-2017, ni bt vi Harry Kane  mt trong nhng tin o hng u Premier League.",
    "name": "Tottenham Hotspur trong Premier League",
    "url": "./sports/tottenham_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Newcastle United, vi bit danh 'Chch che', l mt cu lc b giu truyn thng ti Premier League. Gn y, cu lc b c u t ln t cc ch s hu mi, m ra hy vng tr li thi k hong kim vi nhng v tr cao hn trn bng xp hng.",
    "summary": "Newcastle: i bng truyn thng, ang hi sinh nh ngun u t mi, k vng tr li cnh tranh nh cao.",
    "name": "Newcastle United trong Premier League",
    "url": "./sports/newcastle_premier_league.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Premier League  chng kin nhng mn li ngc dng kinh in, trong  ni bt l trn u gia Manchester City v Queens Park Rangers ma 2011-2012. Vi bn thng quyt nh ca Sergio Agero  pht b gi, Man City ginh chc v ch u tin sau 44 nm.",
    "summary": "Khonh khc lch s: Bn thng ca Sergio Agero gip Man City v ch ma 2011-2012, li ngc dng ng nh.",
    "name": "Nhng khonh khc lch s Premier League",
    "url": "./sports/premier_league_historic_moments.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },



  {
    "content": "AFF Cup, hay cn gi l Gii v ch bng  ng Nam , l gii u bng  cp i tuyn quc gia ca khu vc ng Nam . Gii c t chc ln u vo nm 1996 ti Singapore, vi mc tiu thc y s pht trin bng  khu vc. T nm 2008, gii c i tn thnh AFF Suzuki Cup v  tr thnh s kin th thao ln nht khu vc.",
    "summary": "AFF Cup: Gii u cp i tuyn quc gia ng Nam , t chc ln u nm 1996, i tn thnh AFF Suzuki Cup t 2008.",
    "name": "Gii thiu AFF Cup",
    "url": "./sports/aff_cup_introduction.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vit Nam  ginh chc v ch AFF Cup hai ln, vo cc nm 2008 v 2018. c bit, chin thng nm 2018 di thi HLV Park Hang-seo c xem l ct mc lch s, khng nh v th ca bng  Vit Nam trong khu vc.",
    "summary": "Vit Nam: V ch AFF Cup hai ln (2008, 2018), chin thng 2018 nh du thi k hong kim di HLV Park Hang-seo.",
    "name": "Thnh tch AFF Cup ca Vit Nam",
    "url": "./sports/vietnam_aff_cup.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Thi Lan l i bng giu thnh tch nht trong lch s AFF Cup, vi 6 ln v ch. Cc ln ng quang ca Thi Lan din ra vo cc nm 1996, 2000, 2002, 2014, 2016 v 2020. i bng c bit n vi li chi k thut v s n nh trong sut cc k AFF Cup.",
    "summary": "Thi Lan: i giu thnh tch nht AFF Cup vi 6 ln v ch, ni bt vi li chi k thut v n nh.",
    "name": "Thnh tch AFF Cup ca Thi Lan",
    "url": "./sports/thailand_aff_cup.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Indonesia l i bng c nhiu ln vo chung kt AFF Cup nht nhng cha tng v ch. Indonesia  6 ln ginh ngi  qun, vo cc nm 2000, 2002, 2004, 2010, 2016 v 2020, v c mnh danh l 'ng vua v nh' ca gii u.",
    "summary": "Indonesia: 6 ln  qun AFF Cup, cha tng v ch, c gi l 'ng vua v nh' ca gii.",
    "name": "Thnh tch AFF Cup ca Indonesia",
    "url": "./sports/indonesia_aff_cup.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Singapore l mt trong nhng i bng thnh cng nht trong lch s AFF Cup, vi 4 ln v ch vo cc nm 1998, 2004, 2007 v 2012. i bng c nh gi cao vi li chi thc dng v hiu qu.",
    "summary": "Singapore: V ch AFF Cup 4 ln (1998, 2004, 2007, 2012), ni bt vi li chi thc dng v hiu qu.",
    "name": "Thnh tch AFF Cup ca Singapore",
    "url": "./sports/singapore_aff_cup.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "AFF Cup s dng th thc thi u vng bng v loi trc tip. T nm 2018, vng bng c t chc theo th thc sn nh v sn khch nhm tng tnh cnh tranh v thu ht ngi hm m. Hai i ng u mi bng s tin vo vng bn kt.",
    "summary": "Th thc AFF Cup: Vng bng sn nh v sn khch (t 2018), hai i u bng vo bn kt.",
    "name": "Th thc thi u AFF Cup",
    "url": "./sports/aff_cup_format.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Ngi sao ni bt ti AFF Cup bao gm Kiatisuk Senamuang (Thi Lan), L Cng Vinh (Vit Nam), v Safiq Rahim (Malaysia). H khng ch ginh c nhiu danh hiu m cn gp phn nng tm gii u nh mn trnh din xut sc trn sn c.",
    "summary": "Ngi sao AFF Cup: Kiatisuk Senamuang (Thi Lan), L Cng Vinh (Vit Nam), v Safiq Rahim (Malaysia).",
    "name": "Ngi sao ni bt ti AFF Cup",
    "url": "./sports/aff_cup_legends.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Malaysia  ginh chc v ch AFF Cup duy nht vo nm 2010 sau khi nh bi Indonesia vi tng t s 4-2 sau hai lt trn. i bng  th hin mt tinh thn chin u bn b di s dn dt ca HLV Rajagopal.",
    "summary": "Malaysia: V ch AFF Cup nm 2010 sau chin thng trc Indonesia, th hin tinh thn chin u kin cng.",
    "name": "Thnh tch AFF Cup ca Malaysia",
    "url": "./sports/malaysia_aff_cup.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },




  {
    "content": "Elasticsearch l mt cng c tm kim v phn tch d liu phn tn m ngun m, c xy dng trn Apache Lucene. Elasticsearch cho php lu tr, tm kim v phn tch mt lng ln d liu trong thi gian thc, ph hp vi cc ng dng yu cu tm kim vn bn y  v phn tch log.",
    "summary": "Elasticsearch: Cng c tm kim v phn tch d liu m ngun m, xy dng trn Apache Lucene, h tr thi gian thc.",
    "name": "Gii thiu Elasticsearch",
    "url": "./tech/elasticsearch_introduction.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Elasticsearch c s dng ph bin trong nhiu trng hp nh tm kim vn bn y  (full-text search), phn tch log (log analytics), gim st hiu sut h thng (APM), v xy dng cc dashboard phn tch d liu thi gian thc.",
    "summary": "ng dng Elasticsearch: Tm kim vn bn y , phn tch log, gim st hiu sut (APM), v phn tch thi gian thc.",
    "name": "ng dng ca Elasticsearch",
    "url": "./tech/elasticsearch_use_cases.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Elasticsearch hot ng theo c ch phn tn, vi d liu c lu tr trong cc ch mc (index). Mi ch mc bao gm cc shard (mnh d liu), cho php m rng v chu li. Cc node trong cluster Elasticsearch phi hp vi nhau  phn b v qun l shard.",
    "summary": "C ch Elasticsearch: Hot ng phn tn vi ch mc v shard, h tr m rng v chu li.",
    "name": "C ch hot ng ca Elasticsearch",
    "url": "./tech/elasticsearch_mechanism.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Kibana l mt cng c giao din ngi dng tch hp vi Elasticsearch, cho php ngi dng trc quan ha d liu v to cc dashboard ty chnh. Kibana gip khai thc sc mnh ca Elasticsearch trong vic phn tch d liu v trnh by thng tin.",
    "summary": "Kibana: Giao din trc quan ha d liu tch hp vi Elasticsearch, h tr to dashboard ty chnh.",
    "name": "Kibana v Elasticsearch",
    "url": "./tech/kibana_elasticsearch.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Elasticsearch h tr nhiu phng thc nhp d liu, bao gm RESTful API, Logstash, v Beats. Logstash c s dng  x l v chuyn i d liu trc khi gi vo Elasticsearch, trong khi Beats l cc tc nhn nh thu thp d liu t nhiu ngun khc nhau.",
    "summary": "Nhp d liu vo Elasticsearch: S dng RESTful API, Logstash  x l, v Beats  thu thp d liu.",
    "name": "Nhp d liu vo Elasticsearch",
    "url": "./tech/elasticsearch_data_ingestion.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Elasticsearch s dng DSL (Domain Specific Language)  thc hin cc truy vn. Cc loi truy vn ph bin bao gm truy vn t kha (term query), truy vn phm vi (range query), v truy vn tng hp (aggregation query)  phn tch d liu.",
    "summary": "Truy vn Elasticsearch: S dng DSL vi cc loi truy vn nh term query, range query, v aggregation query.",
    "name": "Truy vn trong Elasticsearch",
    "url": "./tech/elasticsearch_queries.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Elasticsearch cung cp tnh nng bo mt mnh m, bao gm xc thc ngi dng, phn quyn truy cp, v m ha d liu. Elastic Stack phin bn thng mi cn h tr thm cc cng c bo mt nng cao nh gim st v pht hin xm nhp.",
    "summary": "Bo mt Elasticsearch: H tr xc thc, phn quyn, m ha; bn thng mi c gim st v pht hin xm nhp.",
    "name": "Bo mt trong Elasticsearch",
    "url": "./tech/elasticsearch_security.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mt s cng ty ln s dng Elasticsearch bao gm Uber, Netflix, v Slack. Cc cng ty ny trin khai Elasticsearch  ti u ha tm kim, gim st log, v phn tch d liu, gip nng cao hiu sut v tri nghim ngi dng.",
    "summary": "Elasticsearch ti Uber, Netflix, Slack: Ti u tm kim, gim st log, v phn tch d liu.",
    "name": "Cc cng ty s dng Elasticsearch",
    "url": "./tech/elasticsearch_use_cases_industry.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },




  {
    "content": "Big Data  cp n cc tp d liu cc k ln v phc tp m cc cng c x l d liu truyn thng kh c th qun l c. c im chnh ca Big Data c m t qua 3V: Volume (khi lng), Velocity (tc ), v Variety (a dng).",
    "summary": "Big Data: Cc tp d liu ln, phc tp, c trng bi 3V: Khi lng, tc , v a dng.",
    "name": "Gii thiu Big Data",
    "url": "./tech/big_data_introduction.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Big Data c nhiu ng dng trong cc lnh vc khc nhau nh chm sc sc khe, ti chnh, thng mi in t, v marketing. Cc doanh nghip s dng Big Data  phn tch hnh vi khch hng, d bo xu hng, v ti u ha hot ng kinh doanh.",
    "summary": "ng dng Big Data: Phn tch hnh vi khch hng, d bo xu hng, ti u ha kinh doanh, trong cc ngnh nh y t v ti chnh.",
    "name": "ng dng ca Big Data",
    "url": "./tech/big_data_applications.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Hadoop l mt framework m ngun m ph bin  x l v lu tr Big Data. Hadoop hot ng theo m hnh phn tn, bao gm HDFS  lu tr d liu v MapReduce  x l d liu theo tng phn.",
    "summary": "Hadoop: Framework m ngun m  x l v lu tr Big Data, vi HDFS v MapReduce.",
    "name": "Hadoop v Big Data",
    "url": "./tech/hadoop_big_data.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Big Data khng ch gii hn  3V m cn m rng vi cc c im khc nh Veracity ( tin cy) v Value (gi tr).  tin cy phn nh cht lng d liu, cn gi tr cho thy kh nng khai thc thng tin t d liu  mang li li ch thc tin.",
    "summary": "c im m rng ca Big Data:  tin cy (veracity) v gi tr (value) b sung vo 3V truyn thng.",
    "name": "c im m rng ca Big Data",
    "url": "./tech/big_data_characteristics.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Spark l mt cng c x l Big Data mnh m v nhanh chng hn Hadoop nh c ch x l d liu trong b nh. Spark h tr cc th vin nh MLlib (machine learning), GraphX ( th), v Spark SQL  thc hin phn tch d liu.",
    "summary": "Apache Spark: Cng c x l Big Data nhanh hn Hadoop, h tr MLlib, GraphX, v Spark SQL.",
    "name": "Apache Spark v Big Data",
    "url": "./tech/spark_big_data.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Thch thc chnh ca Big Data bao gm vic qun l lu tr d liu, x l d liu trong thi gian thc, m bo bo mt, v phn tch d liu  a ra quyt nh hiu qu. Cn cc gii php cng ngh hin i  gii quyt nhng vn  ny.",
    "summary": "Thch thc Big Data: Lu tr, x l thi gian thc, bo mt, v phn tch d liu hiu qu.",
    "name": "Thch thc trong Big Data",
    "url": "./tech/big_data_challenges.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Big Data gip cc doanh nghip c nhn ha tri nghim khch hng, ti u ha chui cung ng, v xy dng m hnh d on trong cc lnh vc t bn l, ngn hng, n y t.",
    "summary": "Big Data: C nhn ha tri nghim khch hng, ti u chui cung ng, v h tr m hnh d on trong nhiu ngnh.",
    "name": "Big Data trong doanh nghip",
    "url": "./tech/big_data_onedrive.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Cng ty nh Amazon, Google, v Netflix s dng Big Data  ci thin sn phm v dch v. V d, Netflix phn tch hnh vi ngi dng  a ra  xut c nhn ha, cn Amazon ti u ha chui cung ng v d bo nhu cu.",
    "summary": "Big Data ti Amazon, Google, Netflix: Phn tch hnh vi, ti u chui cung ng, v c nhn ha dch v.",
    "name": "ng dng Big Data trong cc cng ty ln",
    "url": "./tech/big_data_in_industry.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },



  {
    "content": "Machine learning l mt trong nhng lnh vc hng li ln t Big Data. Vi lng d liu ln, cc thut ton machine learning c th c hun luyn chnh xc hn, t  ci thin hiu sut trong cc ng dng nh nhn din hnh nh, x l ngn ng t nhin, v d on hnh vi.",
    "summary": "Machine learning v Big Data: Cung cp d liu ln gip ci thin  chnh xc ca cc thut ton.",
    "name": "Machine Learning v Big Data",
    "url": "./tech/big_data_machine_learning.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Big Data c trin khai rng ri trn cc nn tng m my nh AWS, Google Cloud, v Azure. Cc dch v ny cung cp kh nng lu tr d liu linh hot, tnh ton phn tn, v cng c phn tch mnh m gip ti u ha quy trnh x l d liu.",
    "summary": "Big Data v m my: AWS, Google Cloud, Azure cung cp lu tr linh hot v cng c phn tch.",
    "name": "Big Data trn m my",
    "url": "./tech/big_data_cloud_platforms.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Data Lake l mt kho lu tr d liu khng cu trc thng c s dng trong Big Data. N cho php lu tr d liu th t nhiu ngun v h tr x l sau ny khi cn, ph hp cho cc ng dng phn tch v machine learning.",
    "summary": "Data Lake: Kho d liu khng cu trc cho Big Data, h tr phn tch v machine learning.",
    "name": "Data Lake v Big Data",
    "url": "./tech/big_data_data_lake.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "NoSQL databases nh MongoDB, Cassandra, v HBase thng c s dng trong Big Data  qun l d liu phi cu trc v bn cu trc. Cc c s d liu ny cung cp kh nng m rng linh hot v tc  truy vn cao.",
    "summary": "C s d liu NoSQL: MongoDB, Cassandra, HBase h tr Big Data vi d liu phi cu trc v bn cu trc.",
    "name": "NoSQL v Big Data",
    "url": "./tech/big_data_nosql.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mt trong cc khung cng c ph bin  phn tch Big Data l Elastic Stack (ELK Stack), bao gm Elasticsearch, Logstash, v Kibana. Elastic Stack gip thu thp, x l, v trc quan ha d liu ln trong thi gian thc.",
    "summary": "Elastic Stack: Cng c ph bin cho Big Data, bao gm Elasticsearch, Logstash, v Kibana.",
    "name": "Elastic Stack v Big Data",
    "url": "./tech/big_data_elastic_stack.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Thch thc ln ca Big Data bao gm vn  o c v quyn ring t. Cc t chc phi m bo tun th cc quy nh nh GDPR hoc CCPA  bo v thng tin c nhn khi thu thp v x l d liu ln.",
    "summary": "Big Data v o c: m bo quyn ring t, tun th GDPR, CCPA khi thu thp v x l d liu.",
    "name": "o c trong Big Data",
    "url": "./tech/big_data_ethics.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Stream processing frameworks nh Apache Kafka v Apache Flink c s dng trong Big Data  x l d liu theo thi gian thc, ph hp vi cc ng dng yu cu phn tch ngay lp tc nh gim st h thng v pht hin gian ln.",
    "summary": "Stream processing: Apache Kafka v Flink h tr x l d liu Big Data thi gian thc.",
    "name": "Stream Processing v Big Data",
    "url": "./tech/big_data_stream_processing.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Data Visualization l mt yu t quan trng trong Big Data, gip chuyn i cc tp d liu phc tp thnh biu  v dashboard d hiu. Cc cng c nh Tableau, Power BI, v D3.js thng c s dng trong lnh vc ny.",
    "summary": "Trc quan ha d liu: Tableau, Power BI, D3.js h tr phn tch Big Data d hiu hn.",
    "name": "Trc quan ha d liu trong Big Data",
    "url": "./tech/big_data_visualization.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },



  {
    "content": "Data Mining l mt phn quan trng trong Big Data, tp trung vo vic khm ph cc mu v xu hng t tp d liu ln. Cc k thut ph bin bao gm clustering, classification, v association rule mining.",
    "summary": "Data Mining: Phn tch mu v xu hng trong Big Data bng clustering, classification, v association rule mining.",
    "name": "Data Mining v Big Data",
    "url": "./tech/big_data_data_mining.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Predictive Analytics trong Big Data s dng cc thut ton  d on cc kt qu tng lai da trn d liu lch s. Cc ng dng bao gm d bo doanh s, pht hin gian ln, v bo tr d phng.",
    "summary": "Predictive Analytics: D on kt qu tng lai t d liu Big Data, p dng trong d bo doanh s v pht hin gian ln.",
    "name": "Predictive Analytics v Big Data",
    "url": "./tech/big_data_predictive_analytics.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "IoT (Internet of Things) to ra lng d liu khng l c x l bng cc cng ngh Big Data. D liu t cm bin IoT c s dng trong cc lnh vc nh qun l nng lng, chm sc sc khe, v t ng ha cng nghip.",
    "summary": "IoT v Big Data: X l d liu cm bin cho qun l nng lng, y t, v t ng ha.",
    "name": "IoT v Big Data",
    "url": "./tech/big_data_iot.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Edge Computing l mt xu hng ni bt h tr Big Data bng cch x l d liu gn vi ngun pht sinh. iu ny gip gim  tr, tit kim bng thng v tng hiu qu trong cc ng dng thi gian thc.",
    "summary": "Edge Computing: X l d liu Big Data gn ngun, gim  tr v tng hiu qu thi gian thc.",
    "name": "Edge Computing v Big Data",
    "url": "./tech/big_data_edge_computing.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Cng ngh Blockchain ngy cng c tch hp vi Big Data  cung cp gii php bo mt v minh bch. Blockchain c th lu tr lch s d liu mt cch an ton, h tr phn tch trong cc lnh vc ti chnh v chui cung ng.",
    "summary": "Blockchain v Big Data: Bo mt d liu v minh bch, ng dng trong ti chnh v chui cung ng.",
    "name": "Blockchain v Big Data",
    "url": "./tech/big_data_blockchain.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Data Governance l mt kha cnh quan trng trong Big Data, m bo rng d liu c qun l ng cch, tun th cc tiu chun v quy nh. iu ny bao gm vic kim sot quyn truy cp, cht lng d liu, v tnh minh bch.",
    "summary": "Data Governance: Qun l Big Data tun th tiu chun v quy nh, kim sot truy cp v cht lng d liu.",
    "name": "Data Governance trong Big Data",
    "url": "./tech/big_data_governance.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Cc t chc phi li nhun v chnh ph cng s dng Big Data  gii quyt cc vn  x hi, nh d on thin tai, ci thin h thng gio dc, v ti u ha chm sc sc khe cng ng.",
    "summary": "Big Data cho x hi: D on thin tai, ci thin gio dc, v chm sc sc khe cng ng.",
    "name": "Big Data v cc vn  x hi",
    "url": "./tech/big_data_social_impact.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Streaming Data l mt kha cnh c bit ca Big Data, lin quan n vic x l d liu lin tc theo thi gian thc. ng dng ph bin bao gm pht hin gian ln, theo di giao thng, v gim st mng.",
    "summary": "Streaming Data: X l Big Data lin tc, p dng trong pht hin gian ln v gim st giao thng.",
    "name": "Streaming Data v Big Data",
    "url": "./tech/big_data_streaming.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },




  {
    "content": "Hadoop l mt trong nhng cng ngh ct li trong Big Data, cung cp kh nng lu tr v x l d liu phn tn. HDFS v MapReduce l hai thnh phn chnh h tr x l lng ln d liu trn cc cm my ch.",
    "summary": "Hadoop: Nn tng x l Big Data phn tn vi HDFS v MapReduce.",
    "name": "Hadoop v Big Data",
    "url": "./tech/big_data_hadoop.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Apache Spark l mt cng c mnh m cho Big Data, cung cp kh nng x l d liu nhanh hn Hadoop nh c ch in-memory computing. Spark h tr nhiu th vin nh Spark SQL, MLlib, v GraphX cho cc ng dng phc tp.",
    "summary": "Apache Spark: Cng c Big Data vi x l in-memory nhanh chng v th vin tch hp.",
    "name": "Apache Spark v Big Data",
    "url": "./tech/big_data_spark.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mt thch thc quan trng trong Big Data l x l d liu t nhiu ngun a dng nh log server, cm bin IoT, v mng x hi. Vic tch hp d liu yu cu cc cng c ETL mnh m v chun ha d liu trc khi phn tch.",
    "summary": "Tch hp d liu Big Data: i mt vi d liu t nhiu ngun v yu cu chun ha.",
    "name": "Tch hp d liu trong Big Data",
    "url": "./tech/big_data_data_integration.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Thi gian thc hin v chi ph l hai yu t quan trng khi trin khai h thng Big Data. Vic s dng cc nn tng m my nh AWS EMR hoc Google BigQuery gip gim thiu chi ph u t ban u v ci thin kh nng m rng.",
    "summary": "Hiu qu chi ph trong Big Data: S dng m my gim chi ph v tng kh nng m rng.",
    "name": "Chi ph v hiu qu Big Data",
    "url": "./tech/big_data_cost_efficiency.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Natural Language Processing (NLP) l mt lnh vc kt hp vi Big Data  phn tch v x l ngn ng t nhin. Cc ng dng bao gm chatbot, phn tch cm xc, v trch xut thng tin t vn bn.",
    "summary": "NLP v Big Data: ng dng trong chatbot, phn tch cm xc v trch xut thng tin.",
    "name": "NLP v Big Data",
    "url": "./tech/big_data_nlp.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Quy trnh ETL (Extract, Transform, Load) ng vai tr quan trng trong Big Data, cho php ly d liu t nhiu ngun, chuyn i thnh nh dng ph hp, v ti vo kho lu tr  phn tch.",
    "summary": "ETL trong Big Data: Quy trnh x l d liu t ngun n kho lu tr.",
    "name": "ETL v Big Data",
    "url": "./tech/big_data_etl.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Data Fabric l mt khi nim mi trong qun l Big Data, tp trung vo vic kt ni cc ngun d liu khng ng nht  to ra mt h sinh thi d liu lin mch, phc v cho cc ng dng phn tch.",
    "summary": "Data Fabric: Kt ni d liu khng ng nht trong Big Data thnh h sinh thi lin mch.",
    "name": "Data Fabric v Big Data",
    "url": "./tech/big_data_data_fabric.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "X l d liu phi cu trc trong Big Data l mt thch thc ln, c bit i vi d liu nh hnh nh, m thanh, v video. Cc cng c nh TensorFlow v PyTorch h tr phn tch d liu loi ny bng AI v machine learning.",
    "summary": "X l d liu phi cu trc: TensorFlow v PyTorch h tr phn tch d liu hnh nh, m thanh, video.",
    "name": "D liu phi cu trc v Big Data",
    "url": "./tech/big_data_unstructured_data.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },



  {
    "content": "Mng x hi l cc nn tng trc tuyn cho php ngi dng kt ni, chia s thng tin v tng tc vi nhau. Cc nn tng ph bin bao gm Facebook, Instagram, Twitter, v TikTok.",
    "summary": "Mng x hi: Nn tng trc tuyn gip kt ni v chia s thng tin nh Facebook, Instagram, Twitter, TikTok.",
    "name": "Gii thiu v mng x hi",
    "url": "./social_networks/overview_social_networks.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mng x hi ng vai tr quan trng trong marketing k thut s, cung cp cng c qung co mc tiu v phn tch hnh vi ngi dng. Doanh nghip c th tn dng mng x hi  xy dng thng hiu v tng doanh s.",
    "summary": "Vai tr ca mng x hi trong marketing: Cng c qung co mc tiu v phn tch hnh vi.",
    "name": "Mng x hi v marketing k thut s",
    "url": "./social_networks/social_network_marketing.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Cc xu hng mi trong mng x hi bao gm s gia tng ca ni dung video ngn, ng dng AI  c nhn ha tri nghim ngi dng, v s ph bin ca mng x hi phi tp trung.",
    "summary": "Xu hng mng x hi: Ni dung video ngn, AI c nhn ha, v mng x hi phi tp trung.",
    "name": "Xu hng mi trong mng x hi",
    "url": "./social_networks/social_network_trends.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Tc ng tiu cc ca mng x hi bao gm vn  v quyn ring t, lan truyn thng tin sai lch, v nh hng n sc khe tm l. Cc nn tng ang n lc gii quyt nhng vn  ny thng qua ci thin thut ton v chnh sch.",
    "summary": "Tc ng tiu cc ca mng x hi: Quyn ring t, thng tin sai lch, v sc khe tm l.",
    "name": "Tc ng tiu cc ca mng x hi",
    "url": "./social_networks/social_network_negatives.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Tiktok  tr thnh mt hin tng ton cu vi hn 1 t ngi dng, tp trung vo ni dung video ngn v kh nng lan truyn nhanh chng nh thut ton c o.",
    "summary": "TikTok: Nn tng video ngn vi thut ton lan truyn nhanh, thu ht hn 1 t ngi dng.",
    "name": "TikTok v s lan truyn",
    "url": "./social_networks/tiktok_trends.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Instagram l mt nn tng mng x hi ph bin, tp trung vo chia s hnh nh v video. Tnh nng ni bt bao gm Instagram Stories, IGTV, v Reels, gip tng tnh tng tc.",
    "summary": "Instagram: Nn tng chia s hnh nh/video vi tnh nng nh Stories, IGTV, v Reels.",
    "name": "Instagram v cc tnh nng",
    "url": "./social_networks/instagram_features.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mng x hi phi tp trung nh Mastodon ngy cng c ch , cung cp quyn kim sot d liu cao hn v trnh ph thuc vo cc tp on ln.",
    "summary": "Mng x hi phi tp trung: Quyn kim sot d liu cao hn v khng ph thuc vo tp on ln.",
    "name": "Mng x hi phi tp trung",
    "url": "./social_networks/decentralized_social_networks.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Facebook vn duy tr v tr hng u trong lnh vc mng x hi, vi hn 2,8 t ngi dng hot ng hng thng v cc dch v a dng nh Marketplace v Groups.",
    "summary": "Facebook: Dn u mng x hi vi hn 2,8 t ngi dng v cc dch v a dng.",
    "name": "Facebook v s ph bin",
    "url": "./social_networks/facebook_statistics.txt",
    "created_on": "2024-12-08",
    "updated_at": "2024-12-08",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },




  {
    "content": "LinkedIn l mng x hi chuyn nghip, gip ngi dng kt ni vi ng nghip, nh tuyn dng, v cc chuyn gia trong ngnh. LinkedIn cng l mt cng c hu ch cho vic xy dng thng hiu c nhn v tm kim c hi ngh nghip.",
    "summary": "LinkedIn: Mng x hi chuyn nghip gip kt ni ngh nghip v xy dng thng hiu c nhn.",
    "name": "LinkedIn v ngh nghip",
    "url": "./social_networks/linkedin_professional_network.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Snapchat l nn tng mng x hi tp trung vo vic chia s hnh nh v video ngn vi tnh nng t hy sau mt thi gian. Snapchat c bit ph bin trong gii tr nh tnh nng Filters v Stories.",
    "summary": "Snapchat: Mng x hi vi tnh nng chia s video/hnh nh t hy v cc b lc (Filters).",
    "name": "Snapchat v gii tr",
    "url": "./social_networks/snapchat_youth_trends.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Twitter l nn tng micro-blogging, cho php ngi dng chia s suy ngh, tin tc, v quan im trong cc bi vit ngn (tweet). Vi hn 330 triu ngi dng, Twitter  tr thnh cng c quan trng trong cc cuc tho lun cng khai.",
    "summary": "Twitter: Nn tng micro-blogging cho php chia s tin tc, suy ngh, v quan im qua tweet.",
    "name": "Twitter v truyn thng",
    "url": "./social_networks/twitter_microblogging.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Reddit l nn tng cng ng cho php ngi dng tham gia vo cc cuc tho lun, chia s ni dung v nh gi bi vit. Reddit ni bt vi h thng subreddit, ni ngi dng c th tham gia cc cng ng theo s thch.",
    "summary": "Reddit: Nn tng cng ng vi cc subreddit cho cc cuc tho lun v chia s ni dung.",
    "name": "Reddit v cng ng",
    "url": "./social_networks/reddit_community_discussions.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mng x hi  tr thnh cng c quan trng trong chin lc chm sc khch hng. Cc doanh nghip s dng mng x hi  gii quyt khiu ni, phn hi nhanh chng v tng tc vi khch hng trong thi gian thc.",
    "summary": "Chm sc khch hng qua mng x hi: Gii quyt khiu ni v tng tc vi khch hng nhanh chng.",
    "name": "Mng x hi v chm sc khch hng",
    "url": "./social_networks/social_network_customer_service.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "YouTube l nn tng chia s video trc tuyn ln nht th gii, cho php ngi dng ti ln, xem v chia s video. YouTube cng tr thnh ni pht trin s nghip ca nhiu ngi sng to ni dung v ngi ni ting.",
    "summary": "YouTube: Nn tng chia s video ln nht th gii, pht trin s nghip ngi sng to ni dung.",
    "name": "YouTube v sng to ni dung",
    "url": "./social_networks/youtube_content_creation.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "TikTok hin ang thay i cch thc m ngi dng sng to v tiu th ni dung, vi vic tng trng mnh m trong cc th h tr. Nn tng ny ni bt nh vo tnh nng video ngn, m nhc v xu hng lan truyn nhanh chng.",
    "summary": "TikTok: Nn tng video ngn cho th h tr, thay i cch sng to v tiu th ni dung.",
    "name": "TikTok v s sng to",
    "url": "./social_networks/tiktok_creative_innovation.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },



  {
    "content": "WhatsApp, nn tng nhn tin ph bin vi hn 2 t ngi dng, cung cp cc tnh nng nh nhn tin vn bn, gi in video, v chia s tp. WhatsApp  tr thnh mt phn quan trng trong giao tip c nhn v cng vic.",
    "summary": "WhatsApp: Nn tng nhn tin vi hn 2 t ngi dng, h tr nhn tin, gi video v chia s tp.",
    "name": "WhatsApp v giao tip",
    "url": "./social_networks/whatsapp_communication.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Pinterest l mng x hi chia s hnh nh, ni ngi dng c th tm kim v lu li nhng  tng cho cc d n sng to, t thit k ni tht n thi trang. Pinterest  tr thnh cng c hu ch cho cc nh tip th trong vic xy dng chin lc ni dung.",
    "summary": "Pinterest: Mng x hi chia s hnh nh, gip tm kim v lu li  tng sng to.",
    "name": "Pinterest v sng to",
    "url": "./social_networks/pinterest_creativity.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Tumblr l nn tng blog cho php ngi dng ng ti cc bi vit, hnh nh, v video. Tuy khng cn ph bin nh trc, Tumblr vn gi mt cng ng nh nhng mnh m, c bit l trong cc lnh vc ngh thut v vn ha.",
    "summary": "Tumblr: Nn tng blog chia s bi vit, hnh nh v video, vi cng ng ngh thut mnh m.",
    "name": "Tumblr v cng ng sng to",
    "url": "./social_networks/tumblr_creative_community.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Vi s pht trin ca cng ngh v s thay i trong hnh vi ngi dng, cc mng x hi ang bt u ch trng n cc yu t nh bo mt, quyn ring t v bo v d liu. Nhiu nn tng  thc hin cc ci tin nhm p ng cc yu cu v bo v d liu c nhn.",
    "summary": "Bo mt v quyn ring t trn mng x hi: Cc nn tng ang ch trng ci tin bo v d liu c nhn.",
    "name": "Bo mt trn mng x hi",
    "url": "./social_networks/social_network_security.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Cc nghin cu cho thy rng mng x hi c th nh hng mnh m n tm l ngi dng. Cc nghin cu tm l hc  ch ra rng vic s dng mng x hi qu mc c th dn n cm gic c n, lo u v trm cm.",
    "summary": "nh hng tm l ca mng x hi: Nghin cu ch ra tc ng tiu cc n sc khe tm l ca ngi dng.",
    "name": "Tc ng tm l ca mng x hi",
    "url": "./social_networks/social_network_psychological_impact.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Facebook Groups cho php ngi dng to ra cc cng ng da trn s thch chung. y l mt tnh nng mnh m cho cc doanh nghip v t chc, gip h kt ni v tng tc vi khch hng hoc thnh vin ca cng ng.",
    "summary": "Facebook Groups: Tnh nng cng ng cho php kt ni v tng tc vi khch hng hoc thnh vin.",
    "name": "Facebook Groups v cng ng",
    "url": "./social_networks/facebook_groups_communities.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },
  {
    "content": "Mng x hi ang dn tr thnh cng c quan trng trong vic tm kim vic lm. Cc nn tng nh LinkedIn v Twitter cho php ngi dng kt ni trc tip vi nh tuyn dng, chia s h s c nhn, v tham gia vo cc cuc tr chuyn chuyn nghip.",
    "summary": "Mng x hi v tm kim vic lm: LinkedIn v Twitter gip kt ni vi nh tuyn dng v chia s h s.",
    "name": "Mng x hi v c hi ngh nghip",
    "url": "./social_networks/social_network_jobs.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "developer"]
  },



  {
    "content": "Vingroup l mt trong nhng tp on a ngnh ln nht ti Vit Nam, hot ng ch yu trong cc lnh vc bt ng sn, bn l, cng ngh, y t, v  t. Vingroup ni bt vi cc thng hiu nh Vinhomes, VinFast, VinMart, v Vinmec.",
    "summary": "Vingroup: Tp on a ngnh ti Vit Nam, vi cc thng hiu ni bt nh Vinhomes, VinFast, v VinMart.",
    "name": "Gii thiu v Vingroup",
    "url": "./vingroup/introduction.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "VinFast, cng ty con ca Vingroup, l mt trong nhng thng hiu  t Vit Nam ni bt, vi sn phm xe in v  t thng minh. VinFast c thnh lp vo nm 2017 v  nhanh chng chim lnh th trng  t ni a, ng thi m rng ra quc t.",
    "summary": "VinFast: Thng hiu  t in v thng minh ca Vingroup, c thnh lp vo nm 2017.",
    "name": "VinFast v ngnh  t",
    "url": "./vingroup/vinfast_automotive.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vinhomes l mt trong nhng thng hiu bt ng sn hng u ca Vingroup, chuyn pht trin cc d n cn h cao cp v khu  th thng minh. Cc d n ni bt ca Vinhomes bao gm Vinhomes Central Park v Vinhomes Ocean Park.",
    "summary": "Vinhomes: Thng hiu bt ng sn cao cp ca Vingroup, pht trin cc d n  th thng minh.",
    "name": "Vinhomes v bt ng sn",
    "url": "./vingroup/vinhomes_real_estate.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "VinMart l h thng siu th v ca hng tin li thuc Vingroup, cung cp cc sn phm tiu dng, thc phm ti sng v cc dch v khc cho khch hng. VinMart  m rng ra nhiu tnh thnh, cung cp dch v mua sm tin li cho ngi tiu dng.",
    "summary": "VinMart: H thng siu th v ca hng tin li thuc Vingroup, cung cp sn phm tiu dng v thc phm ti sng.",
    "name": "VinMart v bn l",
    "url": "./vingroup/vinmart_retail.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vinmec, mt trong nhng cng ty con ca Vingroup, cung cp cc dch v y t cht lng cao. Vinmec s hu mt chui bnh vin v c s khm cha bnh hin i, tp trung vo chm sc sc khe ton din cho ngi dn.",
    "summary": "Vinmec: H thng bnh vin v dch v y t cao cp thuc Vingroup, chuyn chm sc sc khe ton din.",
    "name": "Vinmec v y t",
    "url": "./vingroup/vinmec_healthcare.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup cng ng vai tr quan trng trong lnh vc cng ngh vi cc d n nh VinSmart, chuyn sn xut in thoi thng minh, v VinAI, tp trung vo nghin cu v pht trin tr tu nhn to. Nhng sn phm ny  khng nh Vingroup trong ngnh cng ngh.",
    "summary": "Vingroup v cng ngh: VinSmart v VinAI gip Vingroup pht trin cc sn phm in t v tr tu nhn to.",
    "name": "Vingroup v cng ngh",
    "url": "./vingroup/vingroup_onedrive.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup  vn tm quc t, khng ch ti th trng Vit Nam m cn m rng sang cc quc gia khc. Nhng d n quc t ca Vingroup tp trung vo lnh vc bt ng sn,  t v cng ngh, trong  ni bt l vic xy dng nh my sn xut  t ti M.",
    "summary": "Vingroup v quc t: M rng sang cc th trng quc t, tp trung vo bt ng sn,  t v cng ngh.",
    "name": "Vingroup m rng quc t",
    "url": "./vingroup/vingroup_international_expansion.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },



  {
    "content": "Vingroup khng ch ni bt trong lnh vc pht trin bt ng sn v cng ngh, m cn c nhng ng gp quan trng trong ngnh gio dc. Tp on  thnh lp trng i hc VinUniversity, ni cung cp cc chng trnh o to i hc v sau i hc cht lng cao vi i tc quc t.",
    "summary": "Vingroup v gio dc: Thnh lp i hc VinUniversity vi chng trnh o to cht lng cao v hp tc quc t.",
    "name": "Vingroup v gio dc",
    "url": "./vingroup/vingroup_onedrive.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup lun ch trng vo vic pht trin bn vng v bo v mi trng. Trong cc d n ca mnh, Vingroup  tch cc u t vo cc cng ngh thn thin vi mi trng v p dng cc gii php gim thiu tc ng tiu cc n h sinh thi.",
    "summary": "Vingroup v bo v mi trng: u t vo cng ngh xanh v gii php pht trin bn vng.",
    "name": "Vingroup v bo v mi trng",
    "url": "./vingroup/vingroup_environmental_protection.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup  m rng ra nhiu lnh vc trong ngnh cng nghip in t, vi cc sn phm nh in thoi thng minh VinSmart v thit b gia nh thng minh. Nhng sn phm ny c pht trin bi cc i ng nghin cu v pht trin trong nc, gp phn nng cao v th ca Vit Nam trong ngnh cng nghip in t ton cu.",
    "summary": "Vingroup v in t: Sn phm in thoi VinSmart v thit b gia nh thng minh nng cao v th Vit Nam.",
    "name": "Vingroup v ngnh cng nghip in t",
    "url": "./vingroup/vingroup_electronics_industry.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "VinAI Research, mt cng ty con ca Vingroup, chuyn nghin cu v pht trin cc cng ngh tr tu nhn to. VinAI  t c nhiu thnh tu ng ch , bao gm cc gii php AI trong cc lnh vc nh nhn din hnh nh, ngn ng t nhin v giao thng thng minh.",
    "summary": "VinAI Research: Cng ty nghin cu tr tu nhn to ca Vingroup, chuyn v nhn din hnh nh v giao thng thng minh.",
    "name": "VinAI Research v tr tu nhn to",
    "url": "./vingroup/vinai_artificial_intelligence.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup khng ch ch trng pht trin doanh nghip m cn rt quan tm n cc hot ng cng ng v h tr x hi. Tp on ny  trin khai nhiu d n t thin, gip  nhng ngi c hon cnh kh khn v gp phn vo cng tc an sinh x hi ti Vit Nam.",
    "summary": "Vingroup v hot ng cng ng: Trin khai cc d n t thin v h tr x hi ti Vit Nam.",
    "name": "Vingroup v cng ng",
    "url": "./vingroup/vingroup_community_support.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup  k kt cc hp tc chin lc vi cc i tc quc t ln  m rng kh nng sn xut v tip cn th trng ton cu. Cc i tc ny bao gm cc cng ty cng ngh,  t v bn l hng u th gii, gip Vingroup nng cao nng lc v tip cn cc cng ngh tin tin.",
    "summary": "Vingroup v i tc quc t: Hp tc vi cc cng ty ln  m rng sn xut v tip cn th trng ton cu.",
    "name": "Vingroup v hp tc quc t",
    "url": "./vingroup/vingroup_international_partnership.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  },
  {
    "content": "Vingroup  xy dng h thng nh my sn xut  t VinFast ti cc khu cng nghip hin i, s dng cng ngh tin tin trong sn xut v lp rp. VinFast khng ch pht trin cc dng xe  t chy xng m cn tp trung vo xe in, nhm p ng nhu cu ngy cng cao v phng tin giao thng xanh.",
    "summary": "VinFast v nh my  t: S dng cng ngh tin tin trong sn xut  t chy xng v xe in.",
    "name": "VinFast v cng ngh sn xut  t",
    "url": "./vingroup/vinfast_automobile_manufacturing.txt",
    "created_on": "2024-12-09",
    "updated_at": "2024-12-09",
    "category": "onedrive",
    "_run_ml_inference": true,
    "rolePermissions": ["reader", "manager"]
  }
]
